local addonName, addon = ...

if GetLocale() ~= "zhCN" then return end

local pack = {
	Name = "QQ表情",
	Icon = "Interface\\addOns\\Emoji-QQ\\Icons\\icon.png",
	IconDir = "Interface\\addOns\\Emoji-QQ\\Icons\\",
	Icons = {
		-- emoji: 10364
		["10364"] = "10364.png",
		-- emoji: 10366
		["10366"] = "10366.png",
		-- emoji: 10362
		["10362"] = "10362.png",
		-- emoji: 10397
		["10397"] = "10397.png",
		-- emoji: 10396
		["10396"] = "10396.png",
		-- emoji: 10360
		["10360"] = "10360.png",
		-- emoji: 10361
		["10361"] = "10361.png",
		-- emoji: 10363
		["10363"] = "10363.png",
		-- emoji: 10365
		["10365"] = "10365.png",
		-- emoji: 10367
		["10367"] = "10367.png",
		-- emoji: 10399
		["10399"] = "10399.png",
		-- emoji: 10398
		["10398"] = "10398.png",
		-- emoji: 10373
		["10373"] = "10373.png",
		-- emoji: 10370
		["10370"] = "10370.png",
		-- emoji: 10375
		["10375"] = "10375.png",
		-- emoji: 10368
		["10368"] = "10368.png",
		-- emoji: 10369
		["10369"] = "10369.png",
		-- emoji: 10371
		["10371"] = "10371.png",
		-- emoji: 10372
		["10372"] = "10372.png",
		-- emoji: 10374
		["10374"] = "10374.png",
		-- emoji: 10382
		["10382"] = "10382.png",
		-- emoji: 10383
		["10383"] = "10383.png",
		-- emoji: 10401
		["10401"] = "10401.png",
		-- emoji: 10400
		["10400"] = "10400.png",
		-- emoji: 10380
		["10380"] = "10380.png",
		-- emoji: 10381
		["10381"] = "10381.png",
		-- emoji: 10379
		["10379"] = "10379.png",
		-- emoji: 10376
		["10376"] = "10376.png",
		-- emoji: 10378
		["10378"] = "10378.png",
		-- emoji: 10377
		["10377"] = "10377.png",
		-- emoji: 10403
		["10403"] = "10403.png",
		-- emoji: 10402
		["10402"] = "10402.png",
		-- emoji: 10390
		["10390"] = "10390.png",
		-- emoji: 10391
		["10391"] = "10391.png",
		-- emoji: 10388
		["10388"] = "10388.png",
		-- emoji: 10389
		["10389"] = "10389.png",
		-- emoji: 10386
		["10386"] = "10386.png",
		-- emoji: 10385
		["10385"] = "10385.png",
		-- emoji: 10384
		["10384"] = "10384.png",
		-- emoji: 10387
		["10387"] = "10387.png",
		-- emoji: 10413
		["10413"] = "10413.png",
		-- emoji: 10405
		["10405"] = "10405.png",
		-- emoji: 10404
		["10404"] = "10404.png",
		-- emoji: 10406
		["10406"] = "10406.png",
		-- emoji: 10410
		["10410"] = "10410.png",
		-- emoji: 10411
		["10411"] = "10411.png",
		-- emoji: 10407
		["10407"] = "10407.png",
		-- emoji: 10408
		["10408"] = "10408.png",
		-- emoji: 10412
		["10412"] = "10412.png",
		-- emoji: 10409
		["10409"] = "10409.png",
		-- emoji: 100
		["100"] = "100.png",
		-- emoji: 101
		["101"] = "101.png",
		-- emoji: 102
		["102"] = "102.png",
		-- emoji: 103
		["103"] = "103.png",
		-- emoji: 104
		["104"] = "104.png",
		-- emoji: 106
		["106"] = "106.png",
		-- emoji: 107
		["107"] = "107.png",
		-- emoji: 108
		["108"] = "108.png",
		-- emoji: 109
		["109"] = "109.png",
		-- emoji: 105
		["105"] = "105.png",
		-- emoji: 110
		["110"] = "110.png",
		-- emoji: 111
		["111"] = "111.png",
		-- emoji: 112
		["112"] = "112.png",
		-- emoji: 113
		["113"] = "113.png",
		-- emoji: 114
		["114"] = "114.png",
		-- emoji: 115
		["115"] = "115.png",
		-- emoji: 116
		["116"] = "116.png",
		-- emoji: 117
		["117"] = "117.png",
		-- emoji: 118
		["118"] = "118.png",
		-- emoji: 119
		["119"] = "119.png",
		-- emoji: 120
		["120"] = "120.png",
		-- emoji: 121
		["121"] = "121.png",
		-- emoji: 122
		["122"] = "122.png",
		-- emoji: 123
		["123"] = "123.png",
		-- emoji: 124
		["124"] = "124.png",
		-- emoji: 125
		["125"] = "125.png",
		-- emoji: 126
		["126"] = "126.png",
		-- emoji: 127
		["127"] = "127.png",
		-- emoji: 128
		["128"] = "128.png",
		-- emoji: 129
		["129"] = "129.png",
		-- emoji: 130
		["130"] = "130.png",
		-- emoji: 131
		["131"] = "131.png",
		-- emoji: 132
		["132"] = "132.png",
		-- emoji: 133
		["133"] = "133.png",
		-- emoji: 134
		["134"] = "134.png",
		-- emoji: 135
		["135"] = "135.png",
		-- emoji: 136
		["136"] = "136.png",
		-- emoji: 137
		["137"] = "137.png",
		-- emoji: 138
		["138"] = "138.png",
		-- emoji: 139
		["139"] = "139.png",
		-- emoji: 140
		["140"] = "140.png",
		-- emoji: 141
		["141"] = "141.png",
		-- emoji: 142
		["142"] = "142.png",
		-- emoji: 143
		["143"] = "143.png",
		-- emoji: 144
		["144"] = "144.png",
		-- emoji: 145
		["145"] = "145.png",
		-- emoji: 146
		["146"] = "146.png",
		-- emoji: 147
		["147"] = "147.png",
		-- emoji: 148
		["148"] = "148.png",
		-- emoji: 149
		["149"] = "149.png",
		-- emoji: 150
		["150"] = "150.png",
		-- emoji: 151
		["151"] = "151.png",
		-- emoji: 10305
		["10305"] = "10305.png",
		-- emoji: 152
		["152"] = "152.png",
		-- emoji: 153
		["153"] = "153.png",
		-- emoji: 154
		["154"] = "154.png",
		-- emoji: 242
		["242"] = "242.png",
		-- emoji: 252
		["252"] = "252.png",
		-- emoji: 249
		["249"] = "249.png",
		-- emoji: 243
		["243"] = "243.png",
		-- emoji: 244
		["244"] = "244.png",
		-- emoji: 282
		["282"] = "282.png",
		-- emoji: 245
		["245"] = "245.png",
		-- emoji: 248
		["248"] = "248.png",
		-- emoji: 247
		["247"] = "247.png",
		-- emoji: 246
		["246"] = "246.png",
		-- emoji: 253
		["253"] = "253.png",
		-- emoji: 10262
		["10262"] = "10262.png",
		-- emoji: 10263
		["10263"] = "10263.png",
		-- emoji: 10264
		["10264"] = "10264.png",
		-- emoji: 10265
		["10265"] = "10265.png",
		-- emoji: 10266
		["10266"] = "10266.png",
		-- emoji: 10267
		["10267"] = "10267.png",
		-- emoji: 10268
		["10268"] = "10268.png",
		-- emoji: 10269
		["10269"] = "10269.png",
		-- emoji: 10270
		["10270"] = "10270.png",
		-- emoji: 10271
		["10271"] = "10271.png",
		-- emoji: 10272
		["10272"] = "10272.png",
		-- emoji: 10277
		["10277"] = "10277.png",
		-- emoji: 10307
		["10307"] = "10307.png",
		-- emoji: 10306
		["10306"] = "10306.png",
		-- emoji: 10281
		["10281"] = "10281.png",
		-- emoji: 10282
		["10282"] = "10282.png",
		-- emoji: 10283
		["10283"] = "10283.png",
		-- emoji: 10284
		["10284"] = "10284.png",
		-- emoji: 10285
		["10285"] = "10285.png",
		-- emoji: 10293
		["10293"] = "10293.png",
		-- emoji: 10286
		["10286"] = "10286.png",
		-- emoji: 10287
		["10287"] = "10287.png",
		-- emoji: 10289
		["10289"] = "10289.png",
		-- emoji: 10294
		["10294"] = "10294.png",
		-- emoji: 10297
		["10297"] = "10297.png",
		-- emoji: 10298
		["10298"] = "10298.png",
		-- emoji: 10299
		["10299"] = "10299.png",
		-- emoji: 10300
		["10300"] = "10300.png",
		-- emoji: 10323
		["10323"] = "10323.png",
		-- emoji: 10332
		["10332"] = "10332.png",
		-- emoji: 10336
		["10336"] = "10336.png",
		-- emoji: 10353
		["10353"] = "10353.png",
		-- emoji: 10355
		["10355"] = "10355.png",
		-- emoji: 10356
		["10356"] = "10356.png",
		-- emoji: 10354
		["10354"] = "10354.png",
		-- emoji: 10352
		["10352"] = "10352.png",
		-- emoji: 10357
		["10357"] = "10357.png",
		-- emoji: 10334
		["10334"] = "10334.png",
		-- emoji: 10347
		["10347"] = "10347.png",
		-- emoji: 10303
		["10303"] = "10303.png",
		-- emoji: 10302
		["10302"] = "10302.png",
		-- emoji: 10295
		["10295"] = "10295.png",
		-- emoji: 10311
		["10311"] = "10311.png",
		-- emoji: 10312
		["10312"] = "10312.png",
		-- emoji: 10314
		["10314"] = "10314.png",
		-- emoji: 10317
		["10317"] = "10317.png",
		-- emoji: 10318
		["10318"] = "10318.png",
		-- emoji: 10319
		["10319"] = "10319.png",
		-- emoji: 10320
		["10320"] = "10320.png",
		-- emoji: 10324
		["10324"] = "10324.png",
		-- emoji: 10325
		["10325"] = "10325.png",
		-- emoji: 10337
		["10337"] = "10337.png",
		-- emoji: 10338
		["10338"] = "10338.png",
		-- emoji: 10339
		["10339"] = "10339.png",
		-- emoji: 10341
		["10341"] = "10341.png",
		-- emoji: 10342
		["10342"] = "10342.png",
		-- emoji: 10343
		["10343"] = "10343.png",
		-- emoji: 10344
		["10344"] = "10344.png",
		-- emoji: 10345
		["10345"] = "10345.png",
		-- emoji: 10346
		["10346"] = "10346.png",
		-- emoji: 251
		["251"] = "251.png",
		-- emoji: 176
		["176"] = "176.png",
		-- emoji: 175
		["175"] = "175.png",
		-- emoji: 10351
		["10351"] = "10351.png",
		-- emoji: 10349
		["10349"] = "10349.png",
		-- emoji: 10350
		["10350"] = "10350.png",
		-- emoji: 10395
		["10395"] = "10395.png",
		-- emoji: 158
		["158"] = "158.png",
		-- emoji: 10358
		["10358"] = "10358.png",
		-- emoji: 10359
		["10359"] = "10359.png",
		-- emoji: 10326
		["10326"] = "10326.png",
		-- emoji: 168
		["168"] = "168.png",
		-- emoji: 178
		["178"] = "178.png",
		-- emoji: 166
		["166"] = "166.png",
		-- emoji: 163
		["163"] = "163.png",
		-- emoji: 164
		["164"] = "164.png",
		-- emoji: 257
		["257"] = "257.png",
		-- emoji: 121011
		["121011"] = "121011.png",
		-- emoji: 165
		["165"] = "165.png",
		-- emoji: 167
		["167"] = "167.png",
		-- emoji: 160
		["160"] = "160.png",
		-- emoji: 255
		["255"] = "255.png",
		-- emoji: 121002
		["121002"] = "121002.png",
		-- emoji: 10333
		["10333"] = "10333.png",
		-- emoji: 10415
		["10415"] = "10415.png",
		-- emoji: 10416
		["10416"] = "10416.png",
		-- emoji: 10417
		["10417"] = "10417.png",
		-- emoji: 10392
		["10392"] = "10392.png",
		-- emoji: 10393
		["10393"] = "10393.png",
		-- emoji: 10394
		["10394"] = "10394.png",
		-- emoji: 179
		["179"] = "179.png",
		-- emoji: 189
		["189"] = "189.png",
		-- emoji: 183
		["183"] = "183.png",
		-- emoji: 181
		["181"] = "181.png",
		-- emoji: 184
		["184"] = "184.png",
		-- emoji: 182
		["182"] = "182.png",
		-- emoji: 185
		["185"] = "185.png",
		-- emoji: 186
		["186"] = "186.png",
		-- emoji: 180
		["180"] = "180.png",
		-- emoji: 188
		["188"] = "188.png",
		-- emoji: 271
		["271"] = "271.png",
		-- emoji: 10273
		["10273"] = "10273.png",
		-- emoji: 162
		["162"] = "162.png",
		-- emoji: 155
		["155"] = "155.png",
		-- emoji: 171
		["171"] = "171.png",
		-- emoji: 121034
		["121034"] = "121034.png",
		-- emoji: 241
		["241"] = "241.png",
		-- emoji: 174
		["174"] = "174.png",
		-- emoji: 121009
		["121009"] = "121009.png",
		-- emoji: 121012
		["121012"] = "121012.png",
		-- emoji: 156
		["156"] = "156.png",
		-- emoji: 193
		["193"] = "193.png",
		-- emoji: 195
		["195"] = "195.png",
		-- emoji: 190
		["190"] = "190.png",
		-- emoji: 192
		["192"] = "192.png",
		-- emoji: 194
		["194"] = "194.png",
		-- emoji: 199
		["199"] = "199.png",
		-- emoji: 191
		["191"] = "191.png",
	},

	GroupInfo = {
		GroupCount = 1,
		EmojiCount = 235,
		{
			SubGroupCount = 1,
			EmojiCount = 235,
			{
				EmojiCount = 235,
				"10364",
				"10366",
				"10362",
				"10397",
				"10396",
				"10360",
				"10361",
				"10363",
				"10365",
				"10367",
				"10399",
				"10398",
				"10373",
				"10370",
				"10375",
				"10368",
				"10369",
				"10371",
				"10372",
				"10374",
				"10382",
				"10383",
				"10401",
				"10400",
				"10380",
				"10381",
				"10379",
				"10376",
				"10378",
				"10377",
				"10403",
				"10402",
				"10390",
				"10391",
				"10388",
				"10389",
				"10386",
				"10385",
				"10384",
				"10387",
				"10413",
				"10405",
				"10404",
				"10406",
				"10410",
				"10411",
				"10407",
				"10408",
				"10412",
				"10409",
				"100",
				"101",
				"102",
				"103",
				"104",
				"106",
				"107",
				"108",
				"109",
				"105",
				"110",
				"111",
				"112",
				"113",
				"114",
				"115",
				"116",
				"117",
				"118",
				"119",
				"120",
				"121",
				"122",
				"123",
				"124",
				"125",
				"126",
				"127",
				"128",
				"129",
				"130",
				"131",
				"132",
				"133",
				"134",
				"135",
				"136",
				"137",
				"138",
				"139",
				"140",
				"141",
				"142",
				"143",
				"144",
				"145",
				"146",
				"147",
				"148",
				"149",
				"150",
				"151",
				"10305",
				"152",
				"153",
				"154",
				"242",
				"252",
				"249",
				"243",
				"244",
				"282",
				"245",
				"248",
				"247",
				"246",
				"253",
				"10262",
				"10263",
				"10264",
				"10265",
				"10266",
				"10267",
				"10268",
				"10269",
				"10270",
				"10271",
				"10272",
				"10277",
				"10307",
				"10306",
				"10281",
				"10282",
				"10283",
				"10284",
				"10285",
				"10293",
				"10286",
				"10287",
				"10289",
				"10294",
				"10297",
				"10298",
				"10299",
				"10300",
				"10323",
				"10332",
				"10336",
				"10353",
				"10355",
				"10356",
				"10354",
				"10352",
				"10357",
				"10334",
				"10347",
				"10303",
				"10302",
				"10295",
				"10311",
				"10312",
				"10314",
				"10317",
				"10318",
				"10319",
				"10320",
				"10324",
				"10325",
				"10337",
				"10338",
				"10339",
				"10341",
				"10342",
				"10343",
				"10344",
				"10345",
				"10346",
				"251",
				"176",
				"175",
				"10351",
				"10349",
				"10350",
				"10395",
				"158",
				"10358",
				"10359",
				"10326",
				"168",
				"178",
				"166",
				"163",
				"164",
				"257",
				"121011",
				"165",
				"167",
				"160",
				"255",
				"121002",
				"10333",
				"10415",
				"10416",
				"10417",
				"10392",
				"10393",
				"10394",
				"179",
				"189",
				"183",
				"181",
				"184",
				"182",
				"185",
				"186",
				"180",
				"188",
				"271",
				"10273",
				"162",
				"155",
				"171",
				"121034",
				"241",
				"174",
				"121009",
				"121012",
				"156",
				"193",
				"195",
				"190",
				"192",
				"194",
				"199",
				"191",
			},

		},
	},

	-- ====================================================================
	-- ========================  key to shortcode =========================
	-- ====================================================================
	KeyToShortcode = {
		-- emoji:10364
		["10364"] = "QQ·超级赞",
		-- emoji:10366
		["10366"] = "QQ·芒狗",
		-- emoji:10362
		["10362"] = "QQ·好兄弟",
		-- emoji:10397
		["10397"] = "QQ·抛媚眼",
		-- emoji:10396
		["10396"] = "QQ·狼狗",
		-- emoji:10360
		["10360"] = "QQ·亲亲",
		-- emoji:10361
		["10361"] = "QQ·狗狗笑哭",
		-- emoji:10363
		["10363"] = "QQ·狗狗可怜",
		-- emoji:10365
		["10365"] = "QQ·狗狗生气",
		-- emoji:10367
		["10367"] = "QQ·狗狗疑问",
		-- emoji:10399
		["10399"] = "QQ·tui",
		-- emoji:10398
		["10398"] = "QQ·超级ok",
		-- emoji:10373
		["10373"] = "QQ·忙",
		-- emoji:10370
		["10370"] = "QQ·祝贺",
		-- emoji:10375
		["10375"] = "QQ·超级鼓掌",
		-- emoji:10368
		["10368"] = "QQ·奥特笑哭",
		-- emoji:10369
		["10369"] = "QQ·彩虹",
		-- emoji:10371
		["10371"] = "QQ·冒泡",
		-- emoji:10372
		["10372"] = "QQ·气呼呼",
		-- emoji:10374
		["10374"] = "QQ·波波流泪",
		-- emoji:10382
		["10382"] = "QQ·emo",
		-- emoji:10383
		["10383"] = "QQ·企鹅爱心",
		-- emoji:10401
		["10401"] = "QQ·超级转圈",
		-- emoji:10400
		["10400"] = "QQ·快乐",
		-- emoji:10380
		["10380"] = "QQ·真棒",
		-- emoji:10381
		["10381"] = "QQ·路过",
		-- emoji:10379
		["10379"] = "QQ·企鹅流泪",
		-- emoji:10376
		["10376"] = "QQ·跺脚",
		-- emoji:10378
		["10378"] = "QQ·企鹅笑哭",
		-- emoji:10377
		["10377"] = "QQ·嗨",
		-- emoji:10403
		["10403"] = "QQ·出去玩",
		-- emoji:10402
		["10402"] = "QQ·别说话",
		-- emoji:10390
		["10390"] = "QQ·太头秃",
		-- emoji:10391
		["10391"] = "QQ·太沧桑",
		-- emoji:10388
		["10388"] = "QQ·太头疼",
		-- emoji:10389
		["10389"] = "QQ·太赞了",
		-- emoji:10386
		["10386"] = "QQ·呜呜呜",
		-- emoji:10385
		["10385"] = "QQ·太气了",
		-- emoji:10384
		["10384"] = "QQ·晚安",
		-- emoji:10387
		["10387"] = "QQ·太好笑",
		-- emoji:10413
		["10413"] = "QQ·摇起来",
		-- emoji:10405
		["10405"] = "QQ·好运来",
		-- emoji:10404
		["10404"] = "QQ·闪亮登场",
		-- emoji:10406
		["10406"] = "QQ·姐是女王",
		-- emoji:10410
		["10410"] = "QQ·么么哒",
		-- emoji:10411
		["10411"] = "QQ·一起嗨",
		-- emoji:10407
		["10407"] = "QQ·我听听",
		-- emoji:10408
		["10408"] = "QQ·臭美",
		-- emoji:10412
		["10412"] = "QQ·开心",
		-- emoji:10409
		["10409"] = "QQ·送你花花",
		-- emoji:100
		["100"] = "QQ·微笑",
		-- emoji:101
		["101"] = "QQ·撇嘴",
		-- emoji:102
		["102"] = "QQ·色",
		-- emoji:103
		["103"] = "QQ·发呆",
		-- emoji:104
		["104"] = "QQ·得意",
		-- emoji:106
		["106"] = "QQ·害羞",
		-- emoji:107
		["107"] = "QQ·闭嘴",
		-- emoji:108
		["108"] = "QQ·睡",
		-- emoji:109
		["109"] = "QQ·大哭",
		-- emoji:105
		["105"] = "QQ·流泪",
		-- emoji:110
		["110"] = "QQ·尴尬",
		-- emoji:111
		["111"] = "QQ·发怒",
		-- emoji:112
		["112"] = "QQ·调皮",
		-- emoji:113
		["113"] = "QQ·呲牙",
		-- emoji:114
		["114"] = "QQ·惊讶",
		-- emoji:115
		["115"] = "QQ·难过",
		-- emoji:116
		["116"] = "QQ·酷",
		-- emoji:117
		["117"] = "QQ·冷汗",
		-- emoji:118
		["118"] = "QQ·抓狂",
		-- emoji:119
		["119"] = "QQ·吐",
		-- emoji:120
		["120"] = "QQ·偷笑",
		-- emoji:121
		["121"] = "QQ·可爱",
		-- emoji:122
		["122"] = "QQ·白眼",
		-- emoji:123
		["123"] = "QQ·傲慢",
		-- emoji:124
		["124"] = "QQ·饥饿",
		-- emoji:125
		["125"] = "QQ·困",
		-- emoji:126
		["126"] = "QQ·惊恐",
		-- emoji:127
		["127"] = "QQ·流汗",
		-- emoji:128
		["128"] = "QQ·憨笑",
		-- emoji:129
		["129"] = "QQ·悠闲",
		-- emoji:130
		["130"] = "QQ·奋斗",
		-- emoji:131
		["131"] = "QQ·咒骂",
		-- emoji:132
		["132"] = "QQ·疑问",
		-- emoji:133
		["133"] = "QQ·嘘",
		-- emoji:134
		["134"] = "QQ·晕",
		-- emoji:135
		["135"] = "QQ·折磨",
		-- emoji:136
		["136"] = "QQ·衰",
		-- emoji:137
		["137"] = "QQ·骷髅",
		-- emoji:138
		["138"] = "QQ·敲打",
		-- emoji:139
		["139"] = "QQ·再见",
		-- emoji:140
		["140"] = "QQ·擦汗",
		-- emoji:141
		["141"] = "QQ·抠鼻",
		-- emoji:142
		["142"] = "QQ·鼓掌",
		-- emoji:143
		["143"] = "QQ·糗大了",
		-- emoji:144
		["144"] = "QQ·坏笑",
		-- emoji:145
		["145"] = "QQ·左哼哼",
		-- emoji:146
		["146"] = "QQ·右哼哼",
		-- emoji:147
		["147"] = "QQ·哈欠",
		-- emoji:148
		["148"] = "QQ·鄙视",
		-- emoji:149
		["149"] = "QQ·委屈",
		-- emoji:150
		["150"] = "QQ·快哭了",
		-- emoji:151
		["151"] = "QQ·阴险",
		-- emoji:10305
		["10305"] = "QQ·右亲亲",
		-- emoji:152
		["152"] = "QQ·左亲亲",
		-- emoji:153
		["153"] = "QQ·吓",
		-- emoji:154
		["154"] = "QQ·可怜",
		-- emoji:242
		["242"] = "QQ·眨眼睛",
		-- emoji:252
		["252"] = "QQ·笑哭",
		-- emoji:249
		["249"] = "QQ·doge",
		-- emoji:243
		["243"] = "QQ·泪奔",
		-- emoji:244
		["244"] = "QQ·无奈",
		-- emoji:282
		["282"] = "QQ·托腮",
		-- emoji:245
		["245"] = "QQ·卖萌",
		-- emoji:248
		["248"] = "QQ·斜眼笑",
		-- emoji:247
		["247"] = "QQ·喷血",
		-- emoji:246
		["246"] = "QQ·小纠结",
		-- emoji:253
		["253"] = "QQ·我最美",
		-- emoji:10262
		["10262"] = "QQ·脑阔疼",
		-- emoji:10263
		["10263"] = "QQ·沧桑",
		-- emoji:10264
		["10264"] = "QQ·捂脸",
		-- emoji:10265
		["10265"] = "QQ·辣眼睛",
		-- emoji:10266
		["10266"] = "QQ·哦哟",
		-- emoji:10267
		["10267"] = "QQ·头秃",
		-- emoji:10268
		["10268"] = "QQ·问号脸",
		-- emoji:10269
		["10269"] = "QQ·暗中观察",
		-- emoji:10270
		["10270"] = "QQ·emm",
		-- emoji:10271
		["10271"] = "QQ·吃瓜",
		-- emoji:10272
		["10272"] = "QQ·呵呵哒",
		-- emoji:10277
		["10277"] = "QQ·汪汪",
		-- emoji:10307
		["10307"] = "QQ·喵喵",
		-- emoji:10306
		["10306"] = "QQ·牛气冲天",
		-- emoji:10281
		["10281"] = "QQ·无眼笑",
		-- emoji:10282
		["10282"] = "QQ·敬礼",
		-- emoji:10283
		["10283"] = "QQ·狂笑",
		-- emoji:10284
		["10284"] = "QQ·面无表情",
		-- emoji:10285
		["10285"] = "QQ·摸鱼",
		-- emoji:10293
		["10293"] = "QQ·摸锦鲤",
		-- emoji:10286
		["10286"] = "QQ·魔鬼笑",
		-- emoji:10287
		["10287"] = "QQ·哦",
		-- emoji:10289
		["10289"] = "QQ·睁眼",
		-- emoji:10294
		["10294"] = "QQ·期待",
		-- emoji:10297
		["10297"] = "QQ·拜谢",
		-- emoji:10298
		["10298"] = "QQ·元宝",
		-- emoji:10299
		["10299"] = "QQ·牛啊",
		-- emoji:10300
		["10300"] = "QQ·胖三斤",
		-- emoji:10323
		["10323"] = "QQ·嫌弃",
		-- emoji:10332
		["10332"] = "QQ·举牌牌",
		-- emoji:10336
		["10336"] = "QQ·豹富",
		-- emoji:10353
		["10353"] = "QQ·拜托",
		-- emoji:10355
		["10355"] = "QQ·耶",
		-- emoji:10356
		["10356"] = "QQ·666",
		-- emoji:10354
		["10354"] = "QQ·尊嘟假嘟",
		-- emoji:10352
		["10352"] = "QQ·咦",
		-- emoji:10357
		["10357"] = "QQ·裂开",
		-- emoji:10334
		["10334"] = "QQ·虎虎生威",
		-- emoji:10347
		["10347"] = "QQ·大展宏兔",
		-- emoji:10303
		["10303"] = "QQ·右拜年",
		-- emoji:10302
		["10302"] = "QQ·左拜年",
		-- emoji:10295
		["10295"] = "QQ·拿到红包",
		-- emoji:10311
		["10311"] = "QQ·打call",
		-- emoji:10312
		["10312"] = "QQ·变形",
		-- emoji:10314
		["10314"] = "QQ·仔细分析",
		-- emoji:10317
		["10317"] = "QQ·菜汪",
		-- emoji:10318
		["10318"] = "QQ·崇拜",
		-- emoji:10319
		["10319"] = "QQ·比心",
		-- emoji:10320
		["10320"] = "QQ·庆祝",
		-- emoji:10324
		["10324"] = "QQ·吃糖",
		-- emoji:10325
		["10325"] = "QQ·惊吓",
		-- emoji:10337
		["10337"] = "QQ·花朵脸",
		-- emoji:10338
		["10338"] = "QQ·我想开了",
		-- emoji:10339
		["10339"] = "QQ·舔屏",
		-- emoji:10341
		["10341"] = "QQ·打招呼",
		-- emoji:10342
		["10342"] = "QQ·酸q",
		-- emoji:10343
		["10343"] = "QQ·我方了",
		-- emoji:10344
		["10344"] = "QQ·大怨种",
		-- emoji:10345
		["10345"] = "QQ·红包多多",
		-- emoji:10346
		["10346"] = "QQ·你真棒棒",
		-- emoji:251
		["251"] = "QQ·戳一戳",
		-- emoji:176
		["176"] = "QQ·太阳",
		-- emoji:175
		["175"] = "QQ·月亮",
		-- emoji:10351
		["10351"] = "QQ·敲敲",
		-- emoji:10349
		["10349"] = "QQ·坚强",
		-- emoji:10350
		["10350"] = "QQ·贴贴",
		-- emoji:10395
		["10395"] = "QQ·略略略",
		-- emoji:158
		["158"] = "QQ·篮球",
		-- emoji:10358
		["10358"] = "QQ·骰子",
		-- emoji:10359
		["10359"] = "QQ·包剪锤",
		-- emoji:10326
		["10326"] = "QQ·生气",
		-- emoji:168
		["168"] = "QQ·蛋糕",
		-- emoji:178
		["178"] = "QQ·拥抱",
		-- emoji:166
		["166"] = "QQ·爱心",
		-- emoji:163
		["163"] = "QQ·玫瑰",
		-- emoji:164
		["164"] = "QQ·凋谢",
		-- emoji:257
		["257"] = "QQ·幽灵",
		-- emoji:121011
		["121011"] = "QQ·爆筋",
		-- emoji:165
		["165"] = "QQ·示爱",
		-- emoji:167
		["167"] = "QQ·心碎",
		-- emoji:160
		["160"] = "QQ·咖啡",
		-- emoji:255
		["255"] = "QQ·羊驼",
		-- emoji:121002
		["121002"] = "QQ·鞭炮",
		-- emoji:10333
		["10333"] = "QQ·烟花",
		-- emoji:10415
		["10415"] = "QQ·划龙舟",
		-- emoji:10416
		["10416"] = "QQ·中龙舟",
		-- emoji:10417
		["10417"] = "QQ·大龙舟",
		-- emoji:10392
		["10392"] = "QQ·龙年快乐",
		-- emoji:10393
		["10393"] = "QQ·新年中龙",
		-- emoji:10394
		["10394"] = "QQ·新年大龙",
		-- emoji:179
		["179"] = "QQ·赞",
		-- emoji:189
		["189"] = "QQ·ok",
		-- emoji:183
		["183"] = "QQ·抱拳",
		-- emoji:181
		["181"] = "QQ·握手",
		-- emoji:184
		["184"] = "QQ·勾引",
		-- emoji:182
		["182"] = "QQ·胜利",
		-- emoji:185
		["185"] = "QQ·拳头",
		-- emoji:186
		["186"] = "QQ·差劲",
		-- emoji:180
		["180"] = "QQ·踩",
		-- emoji:188
		["188"] = "QQ·no",
		-- emoji:271
		["271"] = "QQ·点赞",
		-- emoji:10273
		["10273"] = "QQ·我酸了",
		-- emoji:162
		["162"] = "QQ·猪头",
		-- emoji:155
		["155"] = "QQ·菜刀",
		-- emoji:171
		["171"] = "QQ·刀",
		-- emoji:121034
		["121034"] = "QQ·手枪",
		-- emoji:241
		["241"] = "QQ·茶",
		-- emoji:174
		["174"] = "QQ·便便",
		-- emoji:121009
		["121009"] = "QQ·喝彩",
		-- emoji:121012
		["121012"] = "QQ·棒棒糖",
		-- emoji:156
		["156"] = "QQ·西瓜",
		-- emoji:193
		["193"] = "QQ·发抖",
		-- emoji:195
		["195"] = "QQ·转圈",
		-- emoji:190
		["190"] = "QQ·爱情",
		-- emoji:192
		["192"] = "QQ·跳跳",
		-- emoji:194
		["194"] = "QQ·怄火",
		-- emoji:199
		["199"] = "QQ·挥手",
		-- emoji:191
		["191"] = "QQ·飞吻",
	},

	-- ====================================================================
	-- ======================= short code(s) to key =======================
	-- ====================================================================
	ShortcodesToKey = {
		-- emoji:10364
		["QQ·超级赞"] = "10364",
		-- emoji:10366
		["QQ·芒狗"] = "10366",
		-- emoji:10362
		["QQ·好兄弟"] = "10362",
		-- emoji:10397
		["QQ·抛媚眼"] = "10397",
		-- emoji:10396
		["QQ·狼狗"] = "10396",
		-- emoji:10360
		["QQ·亲亲"] = "10360",
		-- emoji:10361
		["QQ·狗狗笑哭"] = "10361",
		-- emoji:10363
		["QQ·狗狗可怜"] = "10363",
		-- emoji:10365
		["QQ·狗狗生气"] = "10365",
		-- emoji:10367
		["QQ·狗狗疑问"] = "10367",
		-- emoji:10399
		["QQ·tui"] = "10399",
		-- emoji:10398
		["QQ·超级ok"] = "10398",
		-- emoji:10373
		["QQ·忙"] = "10373",
		-- emoji:10370
		["QQ·祝贺"] = "10370",
		-- emoji:10375
		["QQ·超级鼓掌"] = "10375",
		-- emoji:10368
		["QQ·奥特笑哭"] = "10368",
		-- emoji:10369
		["QQ·彩虹"] = "10369",
		-- emoji:10371
		["QQ·冒泡"] = "10371",
		-- emoji:10372
		["QQ·气呼呼"] = "10372",
		-- emoji:10374
		["QQ·波波流泪"] = "10374",
		-- emoji:10382
		["QQ·emo"] = "10382",
		-- emoji:10383
		["QQ·企鹅爱心"] = "10383",
		-- emoji:10401
		["QQ·超级转圈"] = "10401",
		-- emoji:10400
		["QQ·快乐"] = "10400",
		-- emoji:10380
		["QQ·真棒"] = "10380",
		-- emoji:10381
		["QQ·路过"] = "10381",
		-- emoji:10379
		["QQ·企鹅流泪"] = "10379",
		-- emoji:10376
		["QQ·跺脚"] = "10376",
		-- emoji:10378
		["QQ·企鹅笑哭"] = "10378",
		-- emoji:10377
		["QQ·嗨"] = "10377",
		-- emoji:10403
		["QQ·出去玩"] = "10403",
		-- emoji:10402
		["QQ·别说话"] = "10402",
		-- emoji:10390
		["QQ·太头秃"] = "10390",
		-- emoji:10391
		["QQ·太沧桑"] = "10391",
		-- emoji:10388
		["QQ·太头疼"] = "10388",
		-- emoji:10389
		["QQ·太赞了"] = "10389",
		-- emoji:10386
		["QQ·呜呜呜"] = "10386",
		-- emoji:10385
		["QQ·太气了"] = "10385",
		-- emoji:10384
		["QQ·晚安"] = "10384",
		-- emoji:10387
		["QQ·太好笑"] = "10387",
		-- emoji:10413
		["QQ·摇起来"] = "10413",
		-- emoji:10405
		["QQ·好运来"] = "10405",
		-- emoji:10404
		["QQ·闪亮登场"] = "10404",
		-- emoji:10406
		["QQ·姐是女王"] = "10406",
		-- emoji:10410
		["QQ·么么哒"] = "10410",
		-- emoji:10411
		["QQ·一起嗨"] = "10411",
		-- emoji:10407
		["QQ·我听听"] = "10407",
		-- emoji:10408
		["QQ·臭美"] = "10408",
		-- emoji:10412
		["QQ·开心"] = "10412",
		-- emoji:10409
		["QQ·送你花花"] = "10409",
		-- emoji:100
		["QQ·微笑"] = "100",
		-- emoji:101
		["QQ·撇嘴"] = "101",
		-- emoji:102
		["QQ·色"] = "102",
		-- emoji:103
		["QQ·发呆"] = "103",
		-- emoji:104
		["QQ·得意"] = "104",
		-- emoji:106
		["QQ·害羞"] = "106",
		-- emoji:107
		["QQ·闭嘴"] = "107",
		-- emoji:108
		["QQ·睡"] = "108",
		-- emoji:109
		["QQ·大哭"] = "109",
		-- emoji:105
		["QQ·流泪"] = "105",
		-- emoji:110
		["QQ·尴尬"] = "110",
		-- emoji:111
		["QQ·发怒"] = "111",
		-- emoji:112
		["QQ·调皮"] = "112",
		-- emoji:113
		["QQ·呲牙"] = "113",
		-- emoji:114
		["QQ·惊讶"] = "114",
		-- emoji:115
		["QQ·难过"] = "115",
		-- emoji:116
		["QQ·酷"] = "116",
		-- emoji:117
		["QQ·冷汗"] = "117",
		-- emoji:118
		["QQ·抓狂"] = "118",
		-- emoji:119
		["QQ·吐"] = "119",
		-- emoji:120
		["QQ·偷笑"] = "120",
		-- emoji:121
		["QQ·可爱"] = "121",
		-- emoji:122
		["QQ·白眼"] = "122",
		-- emoji:123
		["QQ·傲慢"] = "123",
		-- emoji:124
		["QQ·饥饿"] = "124",
		-- emoji:125
		["QQ·困"] = "125",
		-- emoji:126
		["QQ·惊恐"] = "126",
		-- emoji:127
		["QQ·流汗"] = "127",
		-- emoji:128
		["QQ·憨笑"] = "128",
		-- emoji:129
		["QQ·悠闲"] = "129",
		-- emoji:130
		["QQ·奋斗"] = "130",
		-- emoji:131
		["QQ·咒骂"] = "131",
		-- emoji:132
		["QQ·疑问"] = "132",
		-- emoji:133
		["QQ·嘘"] = "133",
		-- emoji:134
		["QQ·晕"] = "134",
		-- emoji:135
		["QQ·折磨"] = "135",
		-- emoji:136
		["QQ·衰"] = "136",
		-- emoji:137
		["QQ·骷髅"] = "137",
		-- emoji:138
		["QQ·敲打"] = "138",
		-- emoji:139
		["QQ·再见"] = "139",
		-- emoji:140
		["QQ·擦汗"] = "140",
		-- emoji:141
		["QQ·抠鼻"] = "141",
		-- emoji:142
		["QQ·鼓掌"] = "142",
		-- emoji:143
		["QQ·糗大了"] = "143",
		-- emoji:144
		["QQ·坏笑"] = "144",
		-- emoji:145
		["QQ·左哼哼"] = "145",
		-- emoji:146
		["QQ·右哼哼"] = "146",
		-- emoji:147
		["QQ·哈欠"] = "147",
		-- emoji:148
		["QQ·鄙视"] = "148",
		-- emoji:149
		["QQ·委屈"] = "149",
		-- emoji:150
		["QQ·快哭了"] = "150",
		-- emoji:151
		["QQ·阴险"] = "151",
		-- emoji:10305
		["QQ·右亲亲"] = "10305",
		-- emoji:152
		["QQ·左亲亲"] = "152",
		-- emoji:153
		["QQ·吓"] = "153",
		-- emoji:154
		["QQ·可怜"] = "154",
		-- emoji:242
		["QQ·眨眼睛"] = "242",
		-- emoji:252
		["QQ·笑哭"] = "252",
		-- emoji:249
		["QQ·doge"] = "249",
		-- emoji:243
		["QQ·泪奔"] = "243",
		-- emoji:244
		["QQ·无奈"] = "244",
		-- emoji:282
		["QQ·托腮"] = "282",
		-- emoji:245
		["QQ·卖萌"] = "245",
		-- emoji:248
		["QQ·斜眼笑"] = "248",
		-- emoji:247
		["QQ·喷血"] = "247",
		-- emoji:246
		["QQ·小纠结"] = "246",
		-- emoji:253
		["QQ·我最美"] = "253",
		-- emoji:10262
		["QQ·脑阔疼"] = "10262",
		-- emoji:10263
		["QQ·沧桑"] = "10263",
		-- emoji:10264
		["QQ·捂脸"] = "10264",
		-- emoji:10265
		["QQ·辣眼睛"] = "10265",
		-- emoji:10266
		["QQ·哦哟"] = "10266",
		-- emoji:10267
		["QQ·头秃"] = "10267",
		-- emoji:10268
		["QQ·问号脸"] = "10268",
		-- emoji:10269
		["QQ·暗中观察"] = "10269",
		-- emoji:10270
		["QQ·emm"] = "10270",
		-- emoji:10271
		["QQ·吃瓜"] = "10271",
		-- emoji:10272
		["QQ·呵呵哒"] = "10272",
		-- emoji:10277
		["QQ·汪汪"] = "10277",
		-- emoji:10307
		["QQ·喵喵"] = "10307",
		-- emoji:10306
		["QQ·牛气冲天"] = "10306",
		-- emoji:10281
		["QQ·无眼笑"] = "10281",
		-- emoji:10282
		["QQ·敬礼"] = "10282",
		-- emoji:10283
		["QQ·狂笑"] = "10283",
		-- emoji:10284
		["QQ·面无表情"] = "10284",
		-- emoji:10285
		["QQ·摸鱼"] = "10285",
		-- emoji:10293
		["QQ·摸锦鲤"] = "10293",
		-- emoji:10286
		["QQ·魔鬼笑"] = "10286",
		-- emoji:10287
		["QQ·哦"] = "10287",
		-- emoji:10289
		["QQ·睁眼"] = "10289",
		-- emoji:10294
		["QQ·期待"] = "10294",
		-- emoji:10297
		["QQ·拜谢"] = "10297",
		-- emoji:10298
		["QQ·元宝"] = "10298",
		-- emoji:10299
		["QQ·牛啊"] = "10299",
		-- emoji:10300
		["QQ·胖三斤"] = "10300",
		-- emoji:10323
		["QQ·嫌弃"] = "10323",
		-- emoji:10332
		["QQ·举牌牌"] = "10332",
		-- emoji:10336
		["QQ·豹富"] = "10336",
		-- emoji:10353
		["QQ·拜托"] = "10353",
		-- emoji:10355
		["QQ·耶"] = "10355",
		-- emoji:10356
		["QQ·666"] = "10356",
		-- emoji:10354
		["QQ·尊嘟假嘟"] = "10354",
		-- emoji:10352
		["QQ·咦"] = "10352",
		-- emoji:10357
		["QQ·裂开"] = "10357",
		-- emoji:10334
		["QQ·虎虎生威"] = "10334",
		-- emoji:10347
		["QQ·大展宏兔"] = "10347",
		-- emoji:10303
		["QQ·右拜年"] = "10303",
		-- emoji:10302
		["QQ·左拜年"] = "10302",
		-- emoji:10295
		["QQ·拿到红包"] = "10295",
		-- emoji:10311
		["QQ·打call"] = "10311",
		-- emoji:10312
		["QQ·变形"] = "10312",
		-- emoji:10314
		["QQ·仔细分析"] = "10314",
		-- emoji:10317
		["QQ·菜汪"] = "10317",
		-- emoji:10318
		["QQ·崇拜"] = "10318",
		-- emoji:10319
		["QQ·比心"] = "10319",
		-- emoji:10320
		["QQ·庆祝"] = "10320",
		-- emoji:10324
		["QQ·吃糖"] = "10324",
		-- emoji:10325
		["QQ·惊吓"] = "10325",
		-- emoji:10337
		["QQ·花朵脸"] = "10337",
		-- emoji:10338
		["QQ·我想开了"] = "10338",
		-- emoji:10339
		["QQ·舔屏"] = "10339",
		-- emoji:10341
		["QQ·打招呼"] = "10341",
		-- emoji:10342
		["QQ·酸q"] = "10342",
		-- emoji:10343
		["QQ·我方了"] = "10343",
		-- emoji:10344
		["QQ·大怨种"] = "10344",
		-- emoji:10345
		["QQ·红包多多"] = "10345",
		-- emoji:10346
		["QQ·你真棒棒"] = "10346",
		-- emoji:251
		["QQ·戳一戳"] = "251",
		-- emoji:176
		["QQ·太阳"] = "176",
		-- emoji:175
		["QQ·月亮"] = "175",
		-- emoji:10351
		["QQ·敲敲"] = "10351",
		-- emoji:10349
		["QQ·坚强"] = "10349",
		-- emoji:10350
		["QQ·贴贴"] = "10350",
		-- emoji:10395
		["QQ·略略略"] = "10395",
		-- emoji:158
		["QQ·篮球"] = "158",
		-- emoji:10358
		["QQ·骰子"] = "10358",
		-- emoji:10359
		["QQ·包剪锤"] = "10359",
		-- emoji:10326
		["QQ·生气"] = "10326",
		-- emoji:168
		["QQ·蛋糕"] = "168",
		-- emoji:178
		["QQ·拥抱"] = "178",
		-- emoji:166
		["QQ·爱心"] = "166",
		-- emoji:163
		["QQ·玫瑰"] = "163",
		-- emoji:164
		["QQ·凋谢"] = "164",
		-- emoji:257
		["QQ·幽灵"] = "257",
		-- emoji:121011
		["QQ·爆筋"] = "121011",
		-- emoji:165
		["QQ·示爱"] = "165",
		-- emoji:167
		["QQ·心碎"] = "167",
		-- emoji:160
		["QQ·咖啡"] = "160",
		-- emoji:255
		["QQ·羊驼"] = "255",
		-- emoji:121002
		["QQ·鞭炮"] = "121002",
		-- emoji:10333
		["QQ·烟花"] = "10333",
		-- emoji:10415
		["QQ·划龙舟"] = "10415",
		-- emoji:10416
		["QQ·中龙舟"] = "10416",
		-- emoji:10417
		["QQ·大龙舟"] = "10417",
		-- emoji:10392
		["QQ·龙年快乐"] = "10392",
		-- emoji:10393
		["QQ·新年中龙"] = "10393",
		-- emoji:10394
		["QQ·新年大龙"] = "10394",
		-- emoji:179
		["QQ·赞"] = "179",
		-- emoji:189
		["QQ·ok"] = "189",
		-- emoji:183
		["QQ·抱拳"] = "183",
		-- emoji:181
		["QQ·握手"] = "181",
		-- emoji:184
		["QQ·勾引"] = "184",
		-- emoji:182
		["QQ·胜利"] = "182",
		-- emoji:185
		["QQ·拳头"] = "185",
		-- emoji:186
		["QQ·差劲"] = "186",
		-- emoji:180
		["QQ·踩"] = "180",
		-- emoji:188
		["QQ·no"] = "188",
		-- emoji:271
		["QQ·点赞"] = "271",
		-- emoji:10273
		["QQ·我酸了"] = "10273",
		-- emoji:162
		["QQ·猪头"] = "162",
		-- emoji:155
		["QQ·菜刀"] = "155",
		-- emoji:171
		["QQ·刀"] = "171",
		-- emoji:121034
		["QQ·手枪"] = "121034",
		-- emoji:241
		["QQ·茶"] = "241",
		-- emoji:174
		["QQ·便便"] = "174",
		-- emoji:121009
		["QQ·喝彩"] = "121009",
		-- emoji:121012
		["QQ·棒棒糖"] = "121012",
		-- emoji:156
		["QQ·西瓜"] = "156",
		-- emoji:193
		["QQ·发抖"] = "193",
		-- emoji:195
		["QQ·转圈"] = "195",
		-- emoji:190
		["QQ·爱情"] = "190",
		-- emoji:192
		["QQ·跳跳"] = "192",
		-- emoji:194
		["QQ·怄火"] = "194",
		-- emoji:199
		["QQ·挥手"] = "199",
		-- emoji:191
		["QQ·飞吻"] = "191",
	},

	-- ====================================================================
	-- ========================= short code list ==========================
	-- ====================================================================
	ShortcodeList = {
		"QQ·超级赞",
		"QQ·芒狗",
		"QQ·好兄弟",
		"QQ·抛媚眼",
		"QQ·狼狗",
		"QQ·亲亲",
		"QQ·狗狗笑哭",
		"QQ·狗狗可怜",
		"QQ·狗狗生气",
		"QQ·狗狗疑问",
		"QQ·tui",
		"QQ·超级ok",
		"QQ·忙",
		"QQ·祝贺",
		"QQ·超级鼓掌",
		"QQ·奥特笑哭",
		"QQ·彩虹",
		"QQ·冒泡",
		"QQ·气呼呼",
		"QQ·波波流泪",
		"QQ·emo",
		"QQ·企鹅爱心",
		"QQ·超级转圈",
		"QQ·快乐",
		"QQ·真棒",
		"QQ·路过",
		"QQ·企鹅流泪",
		"QQ·跺脚",
		"QQ·企鹅笑哭",
		"QQ·嗨",
		"QQ·出去玩",
		"QQ·别说话",
		"QQ·太头秃",
		"QQ·太沧桑",
		"QQ·太头疼",
		"QQ·太赞了",
		"QQ·呜呜呜",
		"QQ·太气了",
		"QQ·晚安",
		"QQ·太好笑",
		"QQ·摇起来",
		"QQ·好运来",
		"QQ·闪亮登场",
		"QQ·姐是女王",
		"QQ·么么哒",
		"QQ·一起嗨",
		"QQ·我听听",
		"QQ·臭美",
		"QQ·开心",
		"QQ·送你花花",
		"QQ·微笑",
		"QQ·撇嘴",
		"QQ·色",
		"QQ·发呆",
		"QQ·得意",
		"QQ·害羞",
		"QQ·闭嘴",
		"QQ·睡",
		"QQ·大哭",
		"QQ·流泪",
		"QQ·尴尬",
		"QQ·发怒",
		"QQ·调皮",
		"QQ·呲牙",
		"QQ·惊讶",
		"QQ·难过",
		"QQ·酷",
		"QQ·冷汗",
		"QQ·抓狂",
		"QQ·吐",
		"QQ·偷笑",
		"QQ·可爱",
		"QQ·白眼",
		"QQ·傲慢",
		"QQ·饥饿",
		"QQ·困",
		"QQ·惊恐",
		"QQ·流汗",
		"QQ·憨笑",
		"QQ·悠闲",
		"QQ·奋斗",
		"QQ·咒骂",
		"QQ·疑问",
		"QQ·嘘",
		"QQ·晕",
		"QQ·折磨",
		"QQ·衰",
		"QQ·骷髅",
		"QQ·敲打",
		"QQ·再见",
		"QQ·擦汗",
		"QQ·抠鼻",
		"QQ·鼓掌",
		"QQ·糗大了",
		"QQ·坏笑",
		"QQ·左哼哼",
		"QQ·右哼哼",
		"QQ·哈欠",
		"QQ·鄙视",
		"QQ·委屈",
		"QQ·快哭了",
		"QQ·阴险",
		"QQ·右亲亲",
		"QQ·左亲亲",
		"QQ·吓",
		"QQ·可怜",
		"QQ·眨眼睛",
		"QQ·笑哭",
		"QQ·doge",
		"QQ·泪奔",
		"QQ·无奈",
		"QQ·托腮",
		"QQ·卖萌",
		"QQ·斜眼笑",
		"QQ·喷血",
		"QQ·小纠结",
		"QQ·我最美",
		"QQ·脑阔疼",
		"QQ·沧桑",
		"QQ·捂脸",
		"QQ·辣眼睛",
		"QQ·哦哟",
		"QQ·头秃",
		"QQ·问号脸",
		"QQ·暗中观察",
		"QQ·emm",
		"QQ·吃瓜",
		"QQ·呵呵哒",
		"QQ·汪汪",
		"QQ·喵喵",
		"QQ·牛气冲天",
		"QQ·无眼笑",
		"QQ·敬礼",
		"QQ·狂笑",
		"QQ·面无表情",
		"QQ·摸鱼",
		"QQ·摸锦鲤",
		"QQ·魔鬼笑",
		"QQ·哦",
		"QQ·睁眼",
		"QQ·期待",
		"QQ·拜谢",
		"QQ·元宝",
		"QQ·牛啊",
		"QQ·胖三斤",
		"QQ·嫌弃",
		"QQ·举牌牌",
		"QQ·豹富",
		"QQ·拜托",
		"QQ·耶",
		"QQ·666",
		"QQ·尊嘟假嘟",
		"QQ·咦",
		"QQ·裂开",
		"QQ·虎虎生威",
		"QQ·大展宏兔",
		"QQ·右拜年",
		"QQ·左拜年",
		"QQ·拿到红包",
		"QQ·打call",
		"QQ·变形",
		"QQ·仔细分析",
		"QQ·菜汪",
		"QQ·崇拜",
		"QQ·比心",
		"QQ·庆祝",
		"QQ·吃糖",
		"QQ·惊吓",
		"QQ·花朵脸",
		"QQ·我想开了",
		"QQ·舔屏",
		"QQ·打招呼",
		"QQ·酸q",
		"QQ·我方了",
		"QQ·大怨种",
		"QQ·红包多多",
		"QQ·你真棒棒",
		"QQ·戳一戳",
		"QQ·太阳",
		"QQ·月亮",
		"QQ·敲敲",
		"QQ·坚强",
		"QQ·贴贴",
		"QQ·略略略",
		"QQ·篮球",
		"QQ·骰子",
		"QQ·包剪锤",
		"QQ·生气",
		"QQ·蛋糕",
		"QQ·拥抱",
		"QQ·爱心",
		"QQ·玫瑰",
		"QQ·凋谢",
		"QQ·幽灵",
		"QQ·爆筋",
		"QQ·示爱",
		"QQ·心碎",
		"QQ·咖啡",
		"QQ·羊驼",
		"QQ·鞭炮",
		"QQ·烟花",
		"QQ·划龙舟",
		"QQ·中龙舟",
		"QQ·大龙舟",
		"QQ·龙年快乐",
		"QQ·新年中龙",
		"QQ·新年大龙",
		"QQ·赞",
		"QQ·ok",
		"QQ·抱拳",
		"QQ·握手",
		"QQ·勾引",
		"QQ·胜利",
		"QQ·拳头",
		"QQ·差劲",
		"QQ·踩",
		"QQ·no",
		"QQ·点赞",
		"QQ·我酸了",
		"QQ·猪头",
		"QQ·菜刀",
		"QQ·刀",
		"QQ·手枪",
		"QQ·茶",
		"QQ·便便",
		"QQ·喝彩",
		"QQ·棒棒糖",
		"QQ·西瓜",
		"QQ·发抖",
		"QQ·转圈",
		"QQ·爱情",
		"QQ·跳跳",
		"QQ·怄火",
		"QQ·挥手",
		"QQ·飞吻",
		ShortcodeCount = 235,
	},

	["10364"] = {
		Name = "超级赞",
		Shortcodes = {
			"QQ·超级赞",
		},
	},
	["10366"] = {
		Name = "芒狗",
		Shortcodes = {
			"QQ·芒狗",
		},
	},
	["10362"] = {
		Name = "好兄弟",
		Shortcodes = {
			"QQ·好兄弟",
		},
	},
	["10397"] = {
		Name = "抛媚眼",
		Shortcodes = {
			"QQ·抛媚眼",
		},
	},
	["10396"] = {
		Name = "狼狗",
		Shortcodes = {
			"QQ·狼狗",
		},
		Keywords = {
			"狼狗",
			"鬣狗",
			"疯狗",
			"黑狗",
			"鱼狗",
		},
	},
	["10360"] = {
		Name = "亲亲",
		Shortcodes = {
			"QQ·亲亲",
		},
		Keywords = {
			"亲密",
			"密切",
			"亲切",
			"亲近",
			"接近",
			"亲昵",
			"亲热",
			"相亲",
		},
	},
	["10361"] = {
		Name = "狗狗笑哭",
		Shortcodes = {
			"QQ·狗狗笑哭",
		},
	},
	["10363"] = {
		Name = "狗狗可怜",
		Shortcodes = {
			"QQ·狗狗可怜",
		},
		Keywords = {
			"非常",
			"异常",
			"特别",
			"格外",
			"分外",
			"十分",
			"十二分",
			"万分",
		},
	},
	["10365"] = {
		Name = "狗狗生气",
		Shortcodes = {
			"QQ·狗狗生气",
		},
	},
	["10367"] = {
		Name = "狗狗疑问",
		Shortcodes = {
			"QQ·狗狗疑问",
		},
		Keywords = {
			"疑问",
			"问号",
			"问题",
			"疑案",
			"疑团",
			"疑难",
			"疑窦",
			"疑点",
		},
	},
	["10399"] = {
		Name = "tui",
		Shortcodes = {
			"QQ·tui",
		},
	},
	["10398"] = {
		Name = "超级ok",
		Shortcodes = {
			"QQ·超级ok",
		},
	},
	["10373"] = {
		Name = "忙",
		Shortcodes = {
			"QQ·忙",
		},
	},
	["10370"] = {
		Name = "祝贺",
		Shortcodes = {
			"QQ·祝贺",
		},
		Keywords = {
			"祝贺",
			"庆贺",
			"道贺",
			"道喜",
			"庆",
			"贺",
			"拜",
			"恭喜",
		},
	},
	["10375"] = {
		Name = "超级鼓掌",
		Shortcodes = {
			"QQ·超级鼓掌",
		},
		Keywords = {
			"拍手",
			"拍巴掌",
			"鼓掌",
			"拍掌",
			"拊掌",
			"击掌",
			"拍击",
			"缶掌",
		},
	},
	["10368"] = {
		Name = "奥特笑哭",
		Shortcodes = {
			"QQ·奥特笑哭",
		},
	},
	["10369"] = {
		Name = "彩虹",
		Shortcodes = {
			"QQ·彩虹",
		},
		Keywords = {
			"虹",
			"彩虹",
			"鲎",
		},
	},
	["10371"] = {
		Name = "冒泡",
		Shortcodes = {
			"QQ·冒泡",
		},
		Keywords = {
			"冒泡",
		},
	},
	["10372"] = {
		Name = "气呼呼",
		Shortcodes = {
			"QQ·气呼呼",
		},
	},
	["10374"] = {
		Name = "波波流泪",
		Shortcodes = {
			"QQ·波波流泪",
		},
		Keywords = {
			"流泪",
			"挥泪",
			"洒泪",
			"涕零",
			"声泪俱下",
			"落泪",
			"潸然泪下",
		},
	},
	["10382"] = {
		Name = "emo",
		Shortcodes = {
			"QQ·emo",
		},
	},
	["10383"] = {
		Name = "企鹅爱心",
		Shortcodes = {
			"QQ·企鹅爱心",
		},
		Keywords = {
			"企鹅",
			"仁慈",
			"仁爱",
			"慈善",
			"慈祥",
			"慈悲",
			"慈",
			"仁",
			"脸软",
		},
	},
	["10401"] = {
		Name = "超级转圈",
		Shortcodes = {
			"QQ·超级转圈",
		},
		Keywords = {
			"盘旋",
			"回旋",
			"萦回",
			"回绕",
			"打圈子",
			"兜圈子",
			"绕圈子",
			"连轴转",
		},
	},
	["10400"] = {
		Name = "快乐",
		Shortcodes = {
			"QQ·快乐",
		},
	},
	["10380"] = {
		Name = "真棒",
		Shortcodes = {
			"QQ·真棒",
		},
	},
	["10381"] = {
		Name = "路过",
		Shortcodes = {
			"QQ·路过",
		},
		Keywords = {
			"经过",
			"经由",
			"路过",
			"行经",
			"途经",
			"经",
			"过",
			"由",
		},
	},
	["10379"] = {
		Name = "企鹅流泪",
		Shortcodes = {
			"QQ·企鹅流泪",
		},
		Keywords = {
			"企鹅",
			"流泪",
			"挥泪",
			"洒泪",
			"涕零",
			"声泪俱下",
			"落泪",
			"潸然泪下",
		},
	},
	["10376"] = {
		Name = "跺脚",
		Shortcodes = {
			"QQ·跺脚",
		},
		Keywords = {
			"跺脚",
			"跳脚",
			"跺",
		},
	},
	["10378"] = {
		Name = "企鹅笑哭",
		Shortcodes = {
			"QQ·企鹅笑哭",
		},
		Keywords = {
			"企鹅",
		},
	},
	["10377"] = {
		Name = "嗨",
		Shortcodes = {
			"QQ·嗨",
		},
	},
	["10403"] = {
		Name = "出去玩",
		Shortcodes = {
			"QQ·出去玩",
		},
		Keywords = {
			"出",
			"出来",
			"出去",
			"下",
			"沁",
		},
	},
	["10402"] = {
		Name = "别说话",
		Shortcodes = {
			"QQ·别说话",
		},
		Keywords = {
			"讲话",
			"说话",
			"谈话",
			"发话",
			"出言",
			"开口",
			"出口",
			"开腔",
		},
	},
	["10390"] = {
		Name = "太头秃",
		Shortcodes = {
			"QQ·太头秃",
		},
	},
	["10391"] = {
		Name = "太沧桑",
		Shortcodes = {
			"QQ·太沧桑",
		},
		Keywords = {
			"沧海桑田",
			"沧桑",
			"翻天复地",
		},
	},
	["10388"] = {
		Name = "太头疼",
		Shortcodes = {
			"QQ·太头疼",
		},
	},
	["10389"] = {
		Name = "太赞了",
		Shortcodes = {
			"QQ·太赞了",
		},
	},
	["10386"] = {
		Name = "呜呜呜",
		Shortcodes = {
			"QQ·呜呜呜",
		},
	},
	["10385"] = {
		Name = "太气了",
		Shortcodes = {
			"QQ·太气了",
		},
	},
	["10384"] = {
		Name = "晚安",
		Shortcodes = {
			"QQ·晚安",
		},
		Keywords = {
			"晚安",
		},
	},
	["10387"] = {
		Name = "太好笑",
		Shortcodes = {
			"QQ·太好笑",
		},
	},
	["10413"] = {
		Name = "摇起来",
		Shortcodes = {
			"QQ·摇起来",
		},
		Keywords = {
			"兴起",
			"起来",
			"突起",
			"奋起",
			"勃兴",
			"群起",
			"蜂起",
			"起",
		},
	},
	["10405"] = {
		Name = "好运来",
		Shortcodes = {
			"QQ·好运来",
		},
		Keywords = {
			"走运",
			"幸运",
			"万幸",
			"天幸",
			"有幸",
			"侥幸",
			"碰巧",
			"托福",
		},
	},
	["10404"] = {
		Name = "闪亮登场",
		Shortcodes = {
			"QQ·闪亮登场",
		},
		Keywords = {
			"闪光",
			"闪亮",
			"闪烁",
			"闪耀",
			"忽闪",
			"烁烁",
			"忽明忽暗",
			"熠熠闪闪",
			"出台",
			"出场",
			"上",
			"上场",
			"上台",
			"登台",
			"登场",
			"鸣锣登场",
		},
	},
	["10406"] = {
		Name = "姐是女王",
		Shortcodes = {
			"QQ·姐是女王",
		},
		Keywords = {
			"女皇",
			"女王",
		},
	},
	["10410"] = {
		Name = "么么哒",
		Shortcodes = {
			"QQ·么么哒",
		},
	},
	["10411"] = {
		Name = "一起嗨",
		Shortcodes = {
			"QQ·一起嗨",
		},
	},
	["10407"] = {
		Name = "我听听",
		Shortcodes = {
			"QQ·我听听",
		},
		Keywords = {
			"听",
			"收听",
			"听取",
			"听听",
		},
	},
	["10408"] = {
		Name = "臭美",
		Shortcodes = {
			"QQ·臭美",
		},
	},
	["10412"] = {
		Name = "开心",
		Shortcodes = {
			"QQ·开心",
		},
	},
	["10409"] = {
		Name = "送你花花",
		Shortcodes = {
			"QQ·送你花花",
		},
	},
	["100"] = {
		Name = "微笑",
		Shortcodes = {
			"QQ·微笑",
		},
		Keywords = {
			"微笑",
			"莞尔",
			"哂",
			"粲然一笑",
			"嫣然一笑",
			"眉欢眼笑",
			"满面笑容",
			"面带微笑",
		},
	},
	["101"] = {
		Name = "撇嘴",
		Shortcodes = {
			"QQ·撇嘴",
		},
		Keywords = {
			"撅嘴",
			"努嘴",
			"撇嘴",
		},
	},
	["102"] = {
		Name = "色",
		Shortcodes = {
			"QQ·色",
		},
	},
	["103"] = {
		Name = "发呆",
		Shortcodes = {
			"QQ·发呆",
		},
		Keywords = {
			"发呆",
			"发愣",
			"愣神儿",
			"出神",
			"木然",
			"傻眼",
			"呆",
			"愣",
		},
	},
	["104"] = {
		Name = "得意",
		Shortcodes = {
			"QQ·得意",
		},
	},
	["106"] = {
		Name = "害羞",
		Shortcodes = {
			"QQ·害羞",
		},
	},
	["107"] = {
		Name = "闭嘴",
		Shortcodes = {
			"QQ·闭嘴",
		},
	},
	["108"] = {
		Name = "睡",
		Shortcodes = {
			"QQ·睡",
		},
	},
	["109"] = {
		Name = "大哭",
		Shortcodes = {
			"QQ·大哭",
		},
	},
	["105"] = {
		Name = "流泪",
		Shortcodes = {
			"QQ·流泪",
		},
		Keywords = {
			"流泪",
			"挥泪",
			"洒泪",
			"涕零",
			"声泪俱下",
			"落泪",
			"潸然泪下",
		},
	},
	["110"] = {
		Name = "尴尬",
		Shortcodes = {
			"QQ·尴尬",
		},
	},
	["111"] = {
		Name = "发怒",
		Shortcodes = {
			"QQ·发怒",
		},
		Keywords = {
			"动火",
			"动肝火",
			"恼火",
			"冒火",
			"光火",
			"发火",
			"上火",
			"挂火",
		},
	},
	["112"] = {
		Name = "调皮",
		Shortcodes = {
			"QQ·调皮",
		},
	},
	["113"] = {
		Name = "呲牙",
		Shortcodes = {
			"QQ·呲牙",
		},
	},
	["114"] = {
		Name = "惊讶",
		Shortcodes = {
			"QQ·惊讶",
		},
	},
	["115"] = {
		Name = "难过",
		Shortcodes = {
			"QQ·难过",
		},
	},
	["116"] = {
		Name = "酷",
		Shortcodes = {
			"QQ·酷",
		},
	},
	["117"] = {
		Name = "冷汗",
		Shortcodes = {
			"QQ·冷汗",
		},
		Keywords = {
			"冷汗",
			"虚汗",
		},
	},
	["118"] = {
		Name = "抓狂",
		Shortcodes = {
			"QQ·抓狂",
		},
	},
	["119"] = {
		Name = "吐",
		Shortcodes = {
			"QQ·吐",
		},
	},
	["120"] = {
		Name = "偷笑",
		Shortcodes = {
			"QQ·偷笑",
		},
	},
	["121"] = {
		Name = "可爱",
		Shortcodes = {
			"QQ·可爱",
		},
	},
	["122"] = {
		Name = "白眼",
		Shortcodes = {
			"QQ·白眼",
		},
		Keywords = {
			"白眼",
			"白",
			"乜",
		},
	},
	["123"] = {
		Name = "傲慢",
		Shortcodes = {
			"QQ·傲慢",
		},
	},
	["124"] = {
		Name = "饥饿",
		Shortcodes = {
			"QQ·饥饿",
		},
		Keywords = {
			"饿",
			"饥",
			"馁",
			"饥饿",
			"挨饿",
			"饿饭",
			"食不果腹",
			"饥肠辘辘",
		},
	},
	["125"] = {
		Name = "困",
		Shortcodes = {
			"QQ·困",
		},
	},
	["126"] = {
		Name = "惊恐",
		Shortcodes = {
			"QQ·惊恐",
		},
	},
	["127"] = {
		Name = "流汗",
		Shortcodes = {
			"QQ·流汗",
		},
		Keywords = {
			"出汗",
			"流汗",
			"淌汗",
			"挥汗",
			"汗津津",
			"汗流浃背",
			"挥汗如雨",
			"满头大汗",
		},
	},
	["128"] = {
		Name = "憨笑",
		Shortcodes = {
			"QQ·憨笑",
		},
		Keywords = {
			"憨笑",
			"傻笑",
			"傻乐",
			"哂笑",
		},
	},
	["129"] = {
		Name = "悠闲",
		Shortcodes = {
			"QQ·悠闲",
		},
	},
	["130"] = {
		Name = "奋斗",
		Shortcodes = {
			"QQ·奋斗",
		},
		Keywords = {
			"发奋",
			"奋发",
			"奋勉",
			"奋起",
			"奋斗",
			"奋",
			"斗争",
			"努力",
		},
	},
	["131"] = {
		Name = "咒骂",
		Shortcodes = {
			"QQ·咒骂",
		},
		Keywords = {
			"咒骂",
			"诅咒",
		},
	},
	["132"] = {
		Name = "疑问",
		Shortcodes = {
			"QQ·疑问",
		},
		Keywords = {
			"疑问",
			"问号",
			"问题",
			"疑案",
			"疑团",
			"疑难",
			"疑窦",
			"疑点",
		},
	},
	["133"] = {
		Name = "嘘",
		Shortcodes = {
			"QQ·嘘",
		},
	},
	["134"] = {
		Name = "晕",
		Shortcodes = {
			"QQ·晕",
		},
	},
	["135"] = {
		Name = "折磨",
		Shortcodes = {
			"QQ·折磨",
		},
		Keywords = {
			"折磨",
			"折腾",
			"揉搓",
			"煎熬",
			"磨难",
			"磨",
		},
	},
	["136"] = {
		Name = "衰",
		Shortcodes = {
			"QQ·衰",
		},
	},
	["137"] = {
		Name = "骷髅",
		Shortcodes = {
			"QQ·骷髅",
		},
		Keywords = {
			"尸骨",
			"尸骸",
			"骷髅",
			"枯骨",
			"白骨",
			"骸骨",
			"髑髅",
			"残骸",
		},
	},
	["138"] = {
		Name = "敲打",
		Shortcodes = {
			"QQ·敲打",
		},
		Keywords = {
			"敲打",
			"打击",
			"鼓",
			"叩",
			"击",
			"敲",
			"筛",
			"擂",
		},
	},
	["139"] = {
		Name = "再见",
		Shortcodes = {
			"QQ·再见",
		},
		Keywords = {
			"再见",
			"再会",
			"回见",
		},
	},
	["140"] = {
		Name = "擦汗",
		Shortcodes = {
			"QQ·擦汗",
		},
	},
	["141"] = {
		Name = "抠鼻",
		Shortcodes = {
			"QQ·抠鼻",
		},
	},
	["142"] = {
		Name = "鼓掌",
		Shortcodes = {
			"QQ·鼓掌",
		},
		Keywords = {
			"拍手",
			"拍巴掌",
			"鼓掌",
			"拍掌",
			"拊掌",
			"击掌",
			"拍击",
			"缶掌",
		},
	},
	["143"] = {
		Name = "糗大了",
		Shortcodes = {
			"QQ·糗大了",
		},
	},
	["144"] = {
		Name = "坏笑",
		Shortcodes = {
			"QQ·坏笑",
		},
	},
	["145"] = {
		Name = "左哼哼",
		Shortcodes = {
			"QQ·左哼哼",
		},
		Keywords = {
			"呻吟",
			"哼",
			"打呼",
			"哼哼",
		},
	},
	["146"] = {
		Name = "右哼哼",
		Shortcodes = {
			"QQ·右哼哼",
		},
		Keywords = {
			"呻吟",
			"哼",
			"打呼",
			"哼哼",
		},
	},
	["147"] = {
		Name = "哈欠",
		Shortcodes = {
			"QQ·哈欠",
		},
		Keywords = {
			"打呵欠",
			"打哈欠",
			"哈欠",
			"呵欠",
			"微醺",
		},
	},
	["148"] = {
		Name = "鄙视",
		Shortcodes = {
			"QQ·鄙视",
		},
		Keywords = {
			"鄙视",
			"蔑视",
			"藐视",
			"轻视",
			"小视",
			"小看",
			"看轻",
			"鄙薄",
		},
	},
	["149"] = {
		Name = "委屈",
		Shortcodes = {
			"QQ·委屈",
		},
	},
	["150"] = {
		Name = "快哭了",
		Shortcodes = {
			"QQ·快哭了",
		},
	},
	["151"] = {
		Name = "阴险",
		Shortcodes = {
			"QQ·阴险",
		},
		Keywords = {
			"阴险",
			"险恶",
			"阴",
			"险",
			"贼",
			"阴毒",
			"阴骘",
			"凶险",
		},
	},
	["10305"] = {
		Name = "右亲亲",
		Shortcodes = {
			"QQ·右亲亲",
		},
		Keywords = {
			"亲密",
			"密切",
			"亲切",
			"亲近",
			"接近",
			"亲昵",
			"亲热",
			"相亲",
		},
	},
	["152"] = {
		Name = "左亲亲",
		Shortcodes = {
			"QQ·左亲亲",
		},
		Keywords = {
			"亲密",
			"密切",
			"亲切",
			"亲近",
			"接近",
			"亲昵",
			"亲热",
			"相亲",
		},
	},
	["153"] = {
		Name = "吓",
		Shortcodes = {
			"QQ·吓",
		},
	},
	["154"] = {
		Name = "可怜",
		Shortcodes = {
			"QQ·可怜",
		},
		Keywords = {
			"非常",
			"异常",
			"特别",
			"格外",
			"分外",
			"十分",
			"十二分",
			"万分",
		},
	},
	["242"] = {
		Name = "眨眼睛",
		Shortcodes = {
			"QQ·眨眼睛",
		},
	},
	["252"] = {
		Name = "笑哭",
		Shortcodes = {
			"QQ·笑哭",
		},
	},
	["249"] = {
		Name = "doge",
		Shortcodes = {
			"QQ·doge",
		},
	},
	["243"] = {
		Name = "泪奔",
		Shortcodes = {
			"QQ·泪奔",
		},
	},
	["244"] = {
		Name = "无奈",
		Shortcodes = {
			"QQ·无奈",
		},
	},
	["282"] = {
		Name = "托腮",
		Shortcodes = {
			"QQ·托腮",
		},
	},
	["245"] = {
		Name = "卖萌",
		Shortcodes = {
			"QQ·卖萌",
		},
	},
	["248"] = {
		Name = "斜眼笑",
		Shortcodes = {
			"QQ·斜眼笑",
		},
		Keywords = {
			"斜眼",
		},
	},
	["247"] = {
		Name = "喷血",
		Shortcodes = {
			"QQ·喷血",
		},
	},
	["246"] = {
		Name = "小纠结",
		Shortcodes = {
			"QQ·小纠结",
		},
		Keywords = {
			"扭结",
			"纠结",
			"纠",
			"交融",
		},
	},
	["253"] = {
		Name = "我最美",
		Shortcodes = {
			"QQ·我最美",
		},
	},
	["10262"] = {
		Name = "脑阔疼",
		Shortcodes = {
			"QQ·脑阔疼",
		},
	},
	["10263"] = {
		Name = "沧桑",
		Shortcodes = {
			"QQ·沧桑",
		},
		Keywords = {
			"沧海桑田",
			"沧桑",
			"翻天复地",
		},
	},
	["10264"] = {
		Name = "捂脸",
		Shortcodes = {
			"QQ·捂脸",
		},
	},
	["10265"] = {
		Name = "辣眼睛",
		Shortcodes = {
			"QQ·辣眼睛",
		},
		Keywords = {
			"眼",
			"眼睛",
			"目",
			"眸子",
			"肉眼",
			"双目",
			"双眼",
			"双眸",
		},
	},
	["10266"] = {
		Name = "哦哟",
		Shortcodes = {
			"QQ·哦哟",
		},
	},
	["10267"] = {
		Name = "头秃",
		Shortcodes = {
			"QQ·头秃",
		},
	},
	["10268"] = {
		Name = "问号脸",
		Shortcodes = {
			"QQ·问号脸",
		},
		Keywords = {
			"句号",
			"逗号",
			"顿号",
			"分号",
			"问号",
			"冒号",
			"引号",
			"感叹号",
		},
	},
	["10269"] = {
		Name = "暗中观察",
		Shortcodes = {
			"QQ·暗中观察",
		},
		Keywords = {
			"观察",
			"观测",
			"察看",
			"相",
			"观",
			"察",
			"体察",
			"考察",
		},
	},
	["10270"] = {
		Name = "emm",
		Shortcodes = {
			"QQ·emm",
		},
	},
	["10271"] = {
		Name = "吃瓜",
		Shortcodes = {
			"QQ·吃瓜",
		},
	},
	["10272"] = {
		Name = "呵呵哒",
		Shortcodes = {
			"QQ·呵呵哒",
		},
	},
	["10277"] = {
		Name = "汪汪",
		Shortcodes = {
			"QQ·汪汪",
		},
	},
	["10307"] = {
		Name = "喵喵",
		Shortcodes = {
			"QQ·喵喵",
		},
	},
	["10306"] = {
		Name = "牛气冲天",
		Shortcodes = {
			"QQ·牛气冲天",
		},
		Keywords = {
			"牛脾气",
			"牛性",
			"牛劲",
			"牛气",
			"我行我素",
		},
	},
	["10281"] = {
		Name = "无眼笑",
		Shortcodes = {
			"QQ·无眼笑",
		},
	},
	["10282"] = {
		Name = "敬礼",
		Shortcodes = {
			"QQ·敬礼",
		},
		Keywords = {
			"行礼",
			"敬礼",
			"施礼",
			"有礼",
			"致敬",
		},
	},
	["10283"] = {
		Name = "狂笑",
		Shortcodes = {
			"QQ·狂笑",
		},
		Keywords = {
			"大笑",
			"绝倒",
			"喷饭",
			"哄笑",
			"狂笑",
			"噱",
			"哈哈大笑",
			"仰天大笑",
		},
	},
	["10284"] = {
		Name = "面无表情",
		Shortcodes = {
			"QQ·面无表情",
		},
	},
	["10285"] = {
		Name = "摸鱼",
		Shortcodes = {
			"QQ·摸鱼",
		},
	},
	["10293"] = {
		Name = "摸锦鲤",
		Shortcodes = {
			"QQ·摸锦鲤",
		},
	},
	["10286"] = {
		Name = "魔鬼笑",
		Shortcodes = {
			"QQ·魔鬼笑",
		},
		Keywords = {
			"魔鬼",
			"魔",
			"撒旦",
			"鬼魔",
			"鬼神",
			"死神",
			"厉鬼",
		},
	},
	["10287"] = {
		Name = "哦",
		Shortcodes = {
			"QQ·哦",
		},
	},
	["10289"] = {
		Name = "睁眼",
		Shortcodes = {
			"QQ·睁眼",
		},
		Keywords = {
			"睁眼",
			"张目",
			"开眼",
			"睁",
		},
	},
	["10294"] = {
		Name = "期待",
		Shortcodes = {
			"QQ·期待",
		},
		Keywords = {
			"希望",
			"企望",
			"盼望",
			"祈望",
			"祈望",
			"期望",
			"巴望",
			"指望",
		},
	},
	["10297"] = {
		Name = "拜谢",
		Shortcodes = {
			"QQ·拜谢",
		},
	},
	["10298"] = {
		Name = "元宝",
		Shortcodes = {
			"QQ·元宝",
		},
		Keywords = {
			"银元",
			"银洋",
			"洋",
			"洋钱",
			"光洋",
			"现洋",
			"现大洋",
			"大洋",
		},
	},
	["10299"] = {
		Name = "牛啊",
		Shortcodes = {
			"QQ·牛啊",
		},
	},
	["10300"] = {
		Name = "胖三斤",
		Shortcodes = {
			"QQ·胖三斤",
		},
	},
	["10323"] = {
		Name = "嫌弃",
		Shortcodes = {
			"QQ·嫌弃",
		},
		Keywords = {
			"嫌弃",
			"厌弃",
		},
	},
	["10332"] = {
		Name = "举牌牌",
		Shortcodes = {
			"QQ·举牌牌",
		},
	},
	["10336"] = {
		Name = "豹富",
		Shortcodes = {
			"QQ·豹富",
		},
	},
	["10353"] = {
		Name = "拜托",
		Shortcodes = {
			"QQ·拜托",
		},
		Keywords = {
			"拜托",
			"央托",
			"托人情",
			"托人",
		},
	},
	["10355"] = {
		Name = "耶",
		Shortcodes = {
			"QQ·耶",
		},
	},
	["10356"] = {
		Name = "666",
		Shortcodes = {
			"QQ·666",
		},
	},
	["10354"] = {
		Name = "尊嘟假嘟",
		Shortcodes = {
			"QQ·尊嘟假嘟",
		},
	},
	["10352"] = {
		Name = "咦",
		Shortcodes = {
			"QQ·咦",
		},
	},
	["10357"] = {
		Name = "裂开",
		Shortcodes = {
			"QQ·裂开",
		},
		Keywords = {
			"裂开",
			"裂",
			"分裂",
			"破裂",
			"开绽",
			"龟裂",
			"裂缝",
			"裂口",
		},
	},
	["10334"] = {
		Name = "虎虎生威",
		Shortcodes = {
			"QQ·虎虎生威",
		},
	},
	["10347"] = {
		Name = "大展宏兔",
		Shortcodes = {
			"QQ·大展宏兔",
		},
	},
	["10303"] = {
		Name = "右拜年",
		Shortcodes = {
			"QQ·右拜年",
		},
		Keywords = {
			"贺年",
			"拜年",
			"恭贺新禧",
			"贺岁",
			"贺春",
			"团拜",
		},
	},
	["10302"] = {
		Name = "左拜年",
		Shortcodes = {
			"QQ·左拜年",
		},
		Keywords = {
			"贺年",
			"拜年",
			"恭贺新禧",
			"贺岁",
			"贺春",
			"团拜",
		},
	},
	["10295"] = {
		Name = "拿到红包",
		Shortcodes = {
			"QQ·拿到红包",
		},
		Keywords = {
			"牟取",
			"谋取",
			"牟",
			"渔",
			"拿到",
			"贴水",
			"押金",
			"奖金",
			"代金",
			"定钱",
			"赏金",
			"好处费",
			"红包",
		},
	},
	["10311"] = {
		Name = "打call",
		Shortcodes = {
			"QQ·打call",
		},
	},
	["10312"] = {
		Name = "变形",
		Shortcodes = {
			"QQ·变形",
		},
		Keywords = {
			"变价",
			"变频",
			"变速",
			"变相",
			"变形",
			"变线",
		},
	},
	["10314"] = {
		Name = "仔细分析",
		Shortcodes = {
			"QQ·仔细分析",
		},
		Keywords = {
			"分析",
			"辨析",
			"剖析",
			"剖解",
			"析",
			"剖",
			"条分缕析",
			"浅析",
		},
	},
	["10317"] = {
		Name = "菜汪",
		Shortcodes = {
			"QQ·菜汪",
		},
	},
	["10318"] = {
		Name = "崇拜",
		Shortcodes = {
			"QQ·崇拜",
		},
		Keywords = {
			"佩服",
			"敬佩",
			"钦佩",
			"赞佩",
			"佩",
			"畏",
			"崇拜",
			"悦服",
		},
	},
	["10319"] = {
		Name = "比心",
		Shortcodes = {
			"QQ·比心",
		},
	},
	["10320"] = {
		Name = "庆祝",
		Shortcodes = {
			"QQ·庆祝",
		},
		Keywords = {
			"庆祝",
			"庆",
			"欢庆",
		},
	},
	["10324"] = {
		Name = "吃糖",
		Shortcodes = {
			"QQ·吃糖",
		},
	},
	["10325"] = {
		Name = "惊吓",
		Shortcodes = {
			"QQ·惊吓",
		},
		Keywords = {
			"恐吓",
			"恫吓",
			"威吓",
			"吓唬",
			"惊吓",
			"吓",
			"唬",
			"诈唬",
		},
	},
	["10337"] = {
		Name = "花朵脸",
		Shortcodes = {
			"QQ·花朵脸",
		},
		Keywords = {
			"花朵",
			"朵儿",
			"花",
			"繁花",
		},
	},
	["10338"] = {
		Name = "我想开了",
		Shortcodes = {
			"QQ·我想开了",
		},
		Keywords = {
			"悟出",
			"想开",
			"想到",
			"思悟",
			"体悟",
		},
	},
	["10339"] = {
		Name = "舔屏",
		Shortcodes = {
			"QQ·舔屏",
		},
	},
	["10341"] = {
		Name = "打招呼",
		Shortcodes = {
			"QQ·打招呼",
		},
		Keywords = {
			"通知",
			"知照",
			"关照",
			"知会",
			"照会",
			"通告",
			"通",
			"通报",
		},
	},
	["10342"] = {
		Name = "酸Q",
		Shortcodes = {
			"QQ·酸q",
		},
	},
	["10343"] = {
		Name = "我方了",
		Shortcodes = {
			"QQ·我方了",
		},
	},
	["10344"] = {
		Name = "大怨种",
		Shortcodes = {
			"QQ·大怨种",
		},
	},
	["10345"] = {
		Name = "红包多多",
		Shortcodes = {
			"QQ·红包多多",
		},
		Keywords = {
			"贴水",
			"押金",
			"奖金",
			"代金",
			"定钱",
			"赏金",
			"好处费",
			"红包",
		},
	},
	["10346"] = {
		Name = "你真棒棒",
		Shortcodes = {
			"QQ·你真棒棒",
		},
	},
	["251"] = {
		Name = "戳一戳",
		Shortcodes = {
			"QQ·戳一戳",
		},
	},
	["176"] = {
		Name = "太阳",
		Shortcodes = {
			"QQ·太阳",
		},
		Keywords = {
			"日光",
			"阳光",
			"太阳",
			"晖",
			"昱",
			"烨",
			"熹",
		},
	},
	["175"] = {
		Name = "月亮",
		Shortcodes = {
			"QQ·月亮",
		},
		Keywords = {
			"月亮",
			"月球",
			"月",
			"阴",
			"太阴",
			"嫦娥",
			"玉兔",
			"白兔",
		},
	},
	["10351"] = {
		Name = "敲敲",
		Shortcodes = {
			"QQ·敲敲",
		},
		Keywords = {
			"敲打",
			"打击",
			"鼓",
			"叩",
			"击",
			"敲",
			"筛",
			"擂",
		},
	},
	["10349"] = {
		Name = "坚强",
		Shortcodes = {
			"QQ·坚强",
		},
	},
	["10350"] = {
		Name = "贴贴",
		Shortcodes = {
			"QQ·贴贴",
		},
	},
	["10395"] = {
		Name = "略略略",
		Shortcodes = {
			"QQ·略略略",
		},
	},
	["158"] = {
		Name = "篮球",
		Shortcodes = {
			"QQ·篮球",
		},
		Keywords = {
			"篮球",
			"排球",
			"足球",
			"网球",
			"垒球",
			"棒球",
			"曲棍球",
			"冰球",
		},
	},
	["10358"] = {
		Name = "骰子",
		Shortcodes = {
			"QQ·骰子",
		},
		Keywords = {
			"色子",
			"骰子",
		},
	},
	["10359"] = {
		Name = "包剪锤",
		Shortcodes = {
			"QQ·包剪锤",
		},
	},
	["10326"] = {
		Name = "生气",
		Shortcodes = {
			"QQ·生气",
		},
	},
	["168"] = {
		Name = "蛋糕",
		Shortcodes = {
			"QQ·蛋糕",
		},
		Keywords = {
			"糕",
			"蛋糕",
			"花糕",
			"云片糕",
			"发糕",
			"丝糕",
			"年糕",
			"蜂糕",
		},
	},
	["178"] = {
		Name = "拥抱",
		Shortcodes = {
			"QQ·拥抱",
		},
		Keywords = {
			"抱",
			"搂",
			"揽",
			"搂抱",
			"拥抱",
			"抱抱",
		},
	},
	["166"] = {
		Name = "爱心",
		Shortcodes = {
			"QQ·爱心",
		},
		Keywords = {
			"仁慈",
			"仁爱",
			"慈善",
			"慈祥",
			"慈悲",
			"慈",
			"仁",
			"脸软",
		},
	},
	["163"] = {
		Name = "玫瑰",
		Shortcodes = {
			"QQ·玫瑰",
		},
		Keywords = {
			"香菊片",
			"紫荆花",
			"槐花",
			"姊妹花",
			"金合欢花",
			"山花",
			"海棠花",
			"白花",
		},
	},
	["164"] = {
		Name = "凋谢",
		Shortcodes = {
			"QQ·凋谢",
		},
		Keywords = {
			"凋谢",
			"萎谢",
			"凋落",
			"凋零",
			"零落",
			"衰落",
			"衰败",
			"枯萎",
		},
	},
	["257"] = {
		Name = "幽灵",
		Shortcodes = {
			"QQ·幽灵",
		},
		Keywords = {
			"阴魂",
			"幽魂",
			"幽灵",
			"亡灵",
			"亡魂",
			"鬼魂",
			"在天之灵",
		},
	},
	["121011"] = {
		Name = "爆筋",
		Shortcodes = {
			"QQ·爆筋",
		},
	},
	["165"] = {
		Name = "示爱",
		Shortcodes = {
			"QQ·示爱",
		},
	},
	["167"] = {
		Name = "心碎",
		Shortcodes = {
			"QQ·心碎",
		},
		Keywords = {
			"零碎",
			"细碎",
			"零星",
			"零落",
			"零散",
			"碎",
			"散",
			"零",
		},
	},
	["160"] = {
		Name = "咖啡",
		Shortcodes = {
			"QQ·咖啡",
		},
		Keywords = {
			"咖啡",
			"咖啡茶",
			"雀巢咖啡",
		},
	},
	["255"] = {
		Name = "羊驼",
		Shortcodes = {
			"QQ·羊驼",
		},
	},
	["121002"] = {
		Name = "鞭炮",
		Shortcodes = {
			"QQ·鞭炮",
		},
		Keywords = {
			"鞭炮",
			"鞭",
		},
	},
	["10333"] = {
		Name = "烟花",
		Shortcodes = {
			"QQ·烟花",
		},
		Keywords = {
			"烟火",
			"焰火",
			"烟花",
		},
	},
	["10415"] = {
		Name = "划龙舟",
		Shortcodes = {
			"QQ·划龙舟",
		},
		Keywords = {
			"龙舟",
			"龙船",
		},
	},
	["10416"] = {
		Name = "中龙舟",
		Shortcodes = {
			"QQ·中龙舟",
		},
		Keywords = {
			"龙舟",
			"龙船",
		},
	},
	["10417"] = {
		Name = "大龙舟",
		Shortcodes = {
			"QQ·大龙舟",
		},
		Keywords = {
			"龙舟",
			"龙船",
		},
	},
	["10392"] = {
		Name = "龙年快乐",
		Shortcodes = {
			"QQ·龙年快乐",
		},
	},
	["10393"] = {
		Name = "新年中龙",
		Shortcodes = {
			"QQ·新年中龙",
		},
	},
	["10394"] = {
		Name = "新年大龙",
		Shortcodes = {
			"QQ·新年大龙",
		},
	},
	["179"] = {
		Name = "赞",
		Shortcodes = {
			"QQ·赞",
		},
	},
	["189"] = {
		Name = "OK",
		Shortcodes = {
			"QQ·ok",
		},
	},
	["183"] = {
		Name = "抱拳",
		Shortcodes = {
			"QQ·抱拳",
		},
	},
	["181"] = {
		Name = "握手",
		Shortcodes = {
			"QQ·握手",
		},
		Keywords = {
			"握手",
			"拉手",
			"抓手",
		},
	},
	["184"] = {
		Name = "勾引",
		Shortcodes = {
			"QQ·勾引",
		},
		Keywords = {
			"引诱",
			"勾引",
			"利诱",
			"诱惑",
			"诱",
			"饵",
			"啖",
			"吊胃口",
		},
	},
	["182"] = {
		Name = "胜利",
		Shortcodes = {
			"QQ·胜利",
		},
		Keywords = {
			"胜利",
			"取胜",
			"战胜",
			"获胜",
			"得胜",
			"制胜",
			"告捷",
			"大捷",
		},
	},
	["185"] = {
		Name = "拳头",
		Shortcodes = {
			"QQ·拳头",
		},
		Keywords = {
			"拳",
			"拳头",
		},
	},
	["186"] = {
		Name = "差劲",
		Shortcodes = {
			"QQ·差劲",
		},
	},
	["180"] = {
		Name = "踩",
		Shortcodes = {
			"QQ·踩",
		},
	},
	["188"] = {
		Name = "NO",
		Shortcodes = {
			"QQ·no",
		},
	},
	["271"] = {
		Name = "点赞",
		Shortcodes = {
			"QQ·点赞",
		},
	},
	["10273"] = {
		Name = "我酸了",
		Shortcodes = {
			"QQ·我酸了",
		},
	},
	["162"] = {
		Name = "猪头",
		Shortcodes = {
			"QQ·猪头",
		},
	},
	["155"] = {
		Name = "菜刀",
		Shortcodes = {
			"QQ·菜刀",
		},
		Keywords = {
			"砍刀",
			"猎刀",
			"劈刀",
			"绞刀",
			"戒刀",
			"瓦刀",
			"屠刀",
			"菜刀",
		},
	},
	["171"] = {
		Name = "刀",
		Shortcodes = {
			"QQ·刀",
		},
	},
	["121034"] = {
		Name = "手枪",
		Shortcodes = {
			"QQ·手枪",
		},
		Keywords = {
			"手枪",
			"勃郎宁",
			"转轮手枪",
			"无声手枪",
			"发令枪",
			"信号枪",
			"左轮",
			"土枪",
		},
	},
	["241"] = {
		Name = "茶",
		Shortcodes = {
			"QQ·茶",
		},
	},
	["174"] = {
		Name = "便便",
		Shortcodes = {
			"QQ·便便",
		},
	},
	["121009"] = {
		Name = "喝彩",
		Shortcodes = {
			"QQ·喝彩",
		},
		Keywords = {
			"欢呼",
			"喝彩",
			"吹呼",
			"满堂喝彩",
		},
	},
	["121012"] = {
		Name = "棒棒糖",
		Shortcodes = {
			"QQ·棒棒糖",
		},
	},
	["156"] = {
		Name = "西瓜",
		Shortcodes = {
			"QQ·西瓜",
		},
		Keywords = {
			"西瓜",
			"无籽西瓜",
		},
	},
	["193"] = {
		Name = "发抖",
		Shortcodes = {
			"QQ·发抖",
		},
		Keywords = {
			"发抖",
			"颤抖",
			"战抖",
			"抖",
			"寒战",
			"颤栗",
			"哆嗦",
			"筛糠",
		},
	},
	["195"] = {
		Name = "转圈",
		Shortcodes = {
			"QQ·转圈",
		},
		Keywords = {
			"盘旋",
			"回旋",
			"萦回",
			"回绕",
			"打圈子",
			"兜圈子",
			"绕圈子",
			"连轴转",
		},
	},
	["190"] = {
		Name = "爱情",
		Shortcodes = {
			"QQ·爱情",
		},
		Keywords = {
			"爱情",
			"情爱",
			"情意",
			"柔情",
			"痴情",
			"爱恋",
			"情网",
			"情",
		},
	},
	["192"] = {
		Name = "跳跳",
		Shortcodes = {
			"QQ·跳跳",
		},
	},
	["194"] = {
		Name = "怄火",
		Shortcodes = {
			"QQ·怄火",
		},
	},
	["199"] = {
		Name = "挥手",
		Shortcodes = {
			"QQ·挥手",
		},
		Keywords = {
			"挥动",
			"挥舞",
			"舞动",
			"舞弄",
			"挥",
			"舞",
			"抡",
			"晃",
		},
	},
	["191"] = {
		Name = "飞吻",
		Shortcodes = {
			"QQ·飞吻",
		},
		Keywords = {
			"飞吻",
		},
	},

	KeywordList = {
		"搂",
		"闪烁",
		"淌汗",
		"鬣狗",
		"嫣然一笑",
		"日光",
		"涕零",
		"阴毒",
		"登场",
		"行经",
		"吓",
		"睁眼",
		"零落",
		"获胜",
		"哈哈大笑",
		"通",
		"海棠花",
		"熠熠闪闪",
		"莞尔",
		"得胜",
		"听",
		"烁烁",
		"思悟",
		"挥动",
		"团拜",
		"考察",
		"企望",
		"爱恋",
		"开眼",
		"咒骂",
		"贺春",
		"彩虹",
		"纠结",
		"吊胃口",
		"咖啡茶",
		"食不果腹",
		"呆",
		"光火",
		"零碎",
		"挥汗如雨",
		"经由",
		"白眼",
		"幸运",
		"花糕",
		"格外",
		"冰球",
		"舞动",
		"定钱",
		"落泪",
		"拥抱",
		"想开",
		"土枪",
		"晚安",
		"慈悲",
		"告捷",
		"幽魂",
		"我行我素",
		"贺年",
		"山花",
		"走运",
		"亲热",
		"劈刀",
		"女王",
		"问题",
		"残骸",
		"沁",
		"狂笑",
		"有幸",
		"打呼",
		"惊吓",
		"沧桑",
		"出场",
		"云片糕",
		"闪光",
		"寒战",
		"鲎",
		"碎",
		"转轮手枪",
		"繁花",
		"出来",
		"足球",
		"朵儿",
		"双目",
		"饥饿",
		"月亮",
		"红包",
		"拳头",
		"拉手",
		"冒号",
		"粲然一笑",
		"舞弄",
		"句号",
		"爱情",
		"猎刀",
		"接近",
		"努嘴",
		"拍击",
		"哂",
		"擂",
		"裂",
		"胜利",
		"谈话",
		"情",
		"亡魂",
		"佩服",
		"大洋",
		"恭贺新禧",
		"枯骨",
		"糕",
		"万分",
		"小看",
		"托人情",
		"疑案",
		"厉鬼",
		"绝倒",
		"登台",
		"起来",
		"条分缕析",
		"双眸",
		"情意",
		"开口",
		"磨",
		"光洋",
		"烨",
		"年糕",
		"筛糠",
		"发抖",
		"指望",
		"辨析",
		"双眼",
		"击掌",
		"连轴转",
		"哼",
		"厌弃",
		"傻乐",
		"恫吓",
		"感叹号",
		"出去",
		"洋",
		"洋钱",
		"龟裂",
		"慈祥",
		"拍手",
		"冒火",
		"牛气",
		"面带微笑",
		"听取",
		"牛性",
		"出口",
		"愣",
		"脸软",
		"途经",
		"斜眼",
		"唬",
		"虚汗",
		"微笑",
		"慈善",
		"由",
		"焰火",
		"悟出",
		"贺",
		"谋取",
		"努力",
		"出台",
		"贼",
		"零散",
		"呵欠",
		"疑点",
		"香菊片",
		"慈",
		"奋",
		"死神",
		"畏",
		"动肝火",
		"啖",
		"万幸",
		"牟取",
		"折磨",
		"敬礼",
		"鸣锣登场",
		"痴情",
		"交融",
		"散",
		"阳光",
		"饥",
		"揉搓",
		"喝彩",
		"制胜",
		"敲",
		"饵",
		"起",
		"尸骨",
		"诅咒",
		"棒球",
		"愣神儿",
		"饿",
		"忽闪",
		"馁",
		"冒泡",
		"奋起",
		"听听",
		"冷汗",
		"尸骸",
		"打哈欠",
		"贴水",
		"幽灵",
		"发令枪",
		"跳脚",
		"出汗",
		"欢呼",
		"亲切",
		"声泪俱下",
		"挂火",
		"奋斗",
		"屠刀",
		"鬼神",
		"菜刀",
		"龙舟",
		"熹",
		"收听",
		"轻视",
		"傻笑",
		"嫌弃",
		"烟花",
		"观",
		"萎谢",
		"鱼狗",
		"恐吓",
		"战胜",
		"现大洋",
		"亲昵",
		"满堂喝彩",
		"龙船",
		"瓦刀",
		"赞佩",
		"通报",
		"篮球",
		"衰落",
		"挥汗",
		"再见",
		"看轻",
		"藐视",
		"致敬",
		"折腾",
		"哆嗦",
		"傻眼",
		"变线",
		"眉欢眼笑",
		"月球",
		"金合欢花",
		"跺",
		"出",
		"击",
		"零星",
		"盘旋",
		"亡灵",
		"仰天大笑",
		"情爱",
		"满头大汗",
		"蜂糕",
		"打击",
		"髑髅",
		"上",
		"扭结",
		"下",
		"拊掌",
		"煎熬",
		"渔",
		"抓手",
		"洒泪",
		"变价",
		"闪亮",
		"舞",
		"戒刀",
		"发话",
		"变相",
		"知照",
		"抱抱",
		"昱",
		"枯萎",
		"阴",
		"黑狗",
		"威吓",
		"托福",
		"姊妹花",
		"分析",
		"太阴",
		"太阳",
		"群起",
		"撅嘴",
		"左轮",
		"晃",
		"剖解",
		"观察",
		"丝糕",
		"拍掌",
		"剖",
		"晖",
		"开腔",
		"乜",
		"关照",
		"牟",
		"行礼",
		"颤抖",
		"天幸",
		"憨笑",
		"无声手枪",
		"挥泪",
		"险",
		"裂开",
		"跺脚",
		"噱",
		"疑问",
		"赏金",
		"诈唬",
		"说话",
		"虹",
		"上场",
		"白兔",
		"讲话",
		"魔鬼",
		"白",
		"变形",
		"撇嘴",
		"凋零",
		"希望",
		"哂笑",
		"庆",
		"忽明忽暗",
		"握手",
		"细碎",
		"非常",
		"兴起",
		"裂缝",
		"汗津津",
		"贺岁",
		"抖",
		"兜圈子",
		"押金",
		"喷饭",
		"照会",
		"发呆",
		"纠",
		"抡",
		"衰败",
		"蜂起",
		"回旋",
		"阴险",
		"回见",
		"无籽西瓜",
		"仁慈",
		"出神",
		"发火",
		"花",
		"抱",
		"骰子",
		"鞭炮",
		"手枪",
		"相亲",
		"花朵",
		"十二分",
		"垒球",
		"分号",
		"在天之灵",
		"排球",
		"崇拜",
		"仁",
		"大笑",
		"恭喜",
		"蔑视",
		"哄笑",
		"银洋",
		"曲棍球",
		"动火",
		"鼓掌",
		"经",
		"逗号",
		"奋勉",
		"经过",
		"磨难",
		"拍巴掌",
		"特别",
		"拜",
		"祈望",
		"网球",
		"央托",
		"利诱",
		"骸骨",
		"搂抱",
		"体察",
		"玉兔",
		"浅析",
		"槐花",
		"绞刀",
		"目",
		"十分",
		"拜托",
		"拳",
		"阴骘",
		"零",
		"相",
		"骷髅",
		"破裂",
		"木然",
		"信号枪",
		"疯狗",
		"察看",
		"月",
		"密切",
		"呻吟",
		"色子",
		"飞吻",
		"诱惑",
		"鼓",
		"施礼",
		"拜年",
		"眸子",
		"缶掌",
		"突起",
		"通知",
		"勃兴",
		"拿到",
		"银元",
		"情网",
		"挥",
		"再会",
		"悦服",
		"西瓜",
		"敲打",
		"发糕",
		"上台",
		"奖金",
		"碰巧",
		"凶险",
		"绕圈子",
		"疑窦",
		"流汗",
		"大捷",
		"眼",
		"勃郎宁",
		"险恶",
		"睁",
		"疑难",
		"闪耀",
		"代金",
		"顿号",
		"出言",
		"变速",
		"哈欠",
		"魔",
		"狼狗",
		"亲近",
		"道贺",
		"现洋",
		"翻天复地",
		"挨饿",
		"筛",
		"亲密",
		"有礼",
		"通告",
		"烟火",
		"恼火",
		"萦回",
		"佩",
		"吹呼",
		"企鹅",
		"托人",
		"紫荆花",
		"引诱",
		"裂口",
		"敬佩",
		"祝贺",
		"战抖",
		"吓唬",
		"分裂",
		"发愣",
		"侥幸",
		"蛋糕",
		"异常",
		"柔情",
		"疑团",
		"庆贺",
		"女皇",
		"咖啡",
		"满面笑容",
		"引号",
		"哼哼",
		"鬼魔",
		"牛脾气",
		"发奋",
		"析",
		"眼睛",
		"盼望",
		"钦佩",
		"想到",
		"鬼魂",
		"挥舞",
		"撒旦",
		"仁爱",
		"鄙薄",
		"小视",
		"庆祝",
		"阴魂",
		"砍刀",
		"打圈子",
		"沧海桑田",
		"打呵欠",
		"体悟",
		"上火",
		"路过",
		"好处费",
		"欢庆",
		"巴望",
		"鞭",
		"变频",
		"饥肠辘辘",
		"道喜",
		"牛劲",
		"回绕",
		"凋谢",
		"微醺",
		"肉眼",
		"流泪",
		"白骨",
		"张目",
		"过",
		"取胜",
		"期望",
		"汗流浃背",
		"观测",
		"凋落",
		"分外",
		"白花",
		"问号",
		"知会",
		"雀巢咖啡",
		"饿饭",
		"勾引",
		"斗争",
		"鄙视",
		"察",
		"颤栗",
		"叩",
		"奋发",
		"剖析",
		"诱",
		"嫦娥",
		"开绽",
		"潸然泪下",
		"揽",
		KeywordCount = 550
	},

	KeywordIndexes = {
		["搂"] = {
			-- emoji: 178 name: 拥抱
			"178",
		},
		["闪烁"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["淌汗"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["鬣狗"] = {
			-- emoji: 10396 name: 狼狗
			"10396",
		},
		["嫣然一笑"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["日光"] = {
			-- emoji: 176 name: 太阳
			"176",
		},
		["涕零"] = {
			-- emoji: 10374 name: 波波流泪
			"10374",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 105 name: 流泪
			"105",
		},
		["阴毒"] = {
			-- emoji: 151 name: 阴险
			"151",
		},
		["登场"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["行经"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["吓"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["睁眼"] = {
			-- emoji: 10289 name: 睁眼
			"10289",
		},
		["零落"] = {
			-- emoji: 164 name: 凋谢
			"164",
			-- emoji: 167 name: 心碎
			"167",
		},
		["获胜"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["哈哈大笑"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["通"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["海棠花"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["熠熠闪闪"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["莞尔"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["得胜"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["听"] = {
			-- emoji: 10407 name: 我听听
			"10407",
		},
		["烁烁"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["思悟"] = {
			-- emoji: 10338 name: 我想开了
			"10338",
		},
		["挥动"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["团拜"] = {
			-- emoji: 10303 name: 右拜年
			"10303",
			-- emoji: 10302 name: 左拜年
			"10302",
		},
		["考察"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["企望"] = {
			-- emoji: 10294 name: 期待
			"10294",
		},
		["爱恋"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["开眼"] = {
			-- emoji: 10289 name: 睁眼
			"10289",
		},
		["咒骂"] = {
			-- emoji: 131 name: 咒骂
			"131",
		},
		["贺春"] = {
			-- emoji: 10303 name: 右拜年
			"10303",
			-- emoji: 10302 name: 左拜年
			"10302",
		},
		["彩虹"] = {
			-- emoji: 10369 name: 彩虹
			"10369",
		},
		["纠结"] = {
			-- emoji: 246 name: 小纠结
			"246",
		},
		["吊胃口"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["咖啡茶"] = {
			-- emoji: 160 name: 咖啡
			"160",
		},
		["食不果腹"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["呆"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["光火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["零碎"] = {
			-- emoji: 167 name: 心碎
			"167",
		},
		["挥汗如雨"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["经由"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["白眼"] = {
			-- emoji: 122 name: 白眼
			"122",
		},
		["幸运"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["花糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["格外"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["冰球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["舞动"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["定钱"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["落泪"] = {
			-- emoji: 10374 name: 波波流泪
			"10374",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 105 name: 流泪
			"105",
		},
		["拥抱"] = {
			-- emoji: 178 name: 拥抱
			"178",
		},
		["想开"] = {
			-- emoji: 10338 name: 我想开了
			"10338",
		},
		["土枪"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["晚安"] = {
			-- emoji: 10384 name: 晚安
			"10384",
		},
		["慈悲"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["告捷"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["幽魂"] = {
			-- emoji: 257 name: 幽灵
			"257",
		},
		["我行我素"] = {
			-- emoji: 10306 name: 牛气冲天
			"10306",
		},
		["贺年"] = {
			-- emoji: 10303 name: 右拜年
			"10303",
			-- emoji: 10302 name: 左拜年
			"10302",
		},
		["山花"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["走运"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["亲热"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["劈刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["女王"] = {
			-- emoji: 10406 name: 姐是女王
			"10406",
		},
		["问题"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
		},
		["残骸"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["沁"] = {
			-- emoji: 10403 name: 出去玩
			"10403",
		},
		["狂笑"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["有幸"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["打呼"] = {
			-- emoji: 145 name: 左哼哼
			"145",
			-- emoji: 146 name: 右哼哼
			"146",
		},
		["惊吓"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["沧桑"] = {
			-- emoji: 10391 name: 太沧桑
			"10391",
			-- emoji: 10263 name: 沧桑
			"10263",
		},
		["出场"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["云片糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["闪光"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["寒战"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["鲎"] = {
			-- emoji: 10369 name: 彩虹
			"10369",
		},
		["碎"] = {
			-- emoji: 167 name: 心碎
			"167",
		},
		["转轮手枪"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["繁花"] = {
			-- emoji: 10337 name: 花朵脸
			"10337",
		},
		["出来"] = {
			-- emoji: 10403 name: 出去玩
			"10403",
		},
		["足球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["朵儿"] = {
			-- emoji: 10337 name: 花朵脸
			"10337",
		},
		["双目"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["饥饿"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["月亮"] = {
			-- emoji: 175 name: 月亮
			"175",
		},
		["红包"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["拳头"] = {
			-- emoji: 185 name: 拳头
			"185",
		},
		["拉手"] = {
			-- emoji: 181 name: 握手
			"181",
		},
		["冒号"] = {
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["粲然一笑"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["舞弄"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["句号"] = {
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["爱情"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["猎刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["接近"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["努嘴"] = {
			-- emoji: 101 name: 撇嘴
			"101",
		},
		["拍击"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["哂"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["擂"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["裂"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["胜利"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["谈话"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["情"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["亡魂"] = {
			-- emoji: 257 name: 幽灵
			"257",
		},
		["佩服"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["大洋"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["恭贺新禧"] = {
			-- emoji: 10303 name: 右拜年
			"10303",
			-- emoji: 10302 name: 左拜年
			"10302",
		},
		["枯骨"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["万分"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["小看"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["托人情"] = {
			-- emoji: 10353 name: 拜托
			"10353",
		},
		["疑案"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
		},
		["厉鬼"] = {
			-- emoji: 10286 name: 魔鬼笑
			"10286",
		},
		["绝倒"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["登台"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["起来"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
		},
		["条分缕析"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["双眸"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["情意"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["开口"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["磨"] = {
			-- emoji: 135 name: 折磨
			"135",
		},
		["光洋"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["烨"] = {
			-- emoji: 176 name: 太阳
			"176",
		},
		["年糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["筛糠"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["发抖"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["指望"] = {
			-- emoji: 10294 name: 期待
			"10294",
		},
		["辨析"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["双眼"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["击掌"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["连轴转"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["哼"] = {
			-- emoji: 145 name: 左哼哼
			"145",
			-- emoji: 146 name: 右哼哼
			"146",
		},
		["厌弃"] = {
			-- emoji: 10323 name: 嫌弃
			"10323",
		},
		["傻乐"] = {
			-- emoji: 128 name: 憨笑
			"128",
		},
		["恫吓"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["感叹号"] = {
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["出去"] = {
			-- emoji: 10403 name: 出去玩
			"10403",
		},
		["洋"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["洋钱"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["龟裂"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["慈祥"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["拍手"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["冒火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["牛气"] = {
			-- emoji: 10306 name: 牛气冲天
			"10306",
		},
		["面带微笑"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["听取"] = {
			-- emoji: 10407 name: 我听听
			"10407",
		},
		["牛性"] = {
			-- emoji: 10306 name: 牛气冲天
			"10306",
		},
		["出口"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["愣"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["脸软"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["途经"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["斜眼"] = {
			-- emoji: 248 name: 斜眼笑
			"248",
		},
		["唬"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["虚汗"] = {
			-- emoji: 117 name: 冷汗
			"117",
		},
		["微笑"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["慈善"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["由"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["焰火"] = {
			-- emoji: 10333 name: 烟花
			"10333",
		},
		["悟出"] = {
			-- emoji: 10338 name: 我想开了
			"10338",
		},
		["贺"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
		},
		["谋取"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
		},
		["努力"] = {
			-- emoji: 130 name: 奋斗
			"130",
		},
		["出台"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["贼"] = {
			-- emoji: 151 name: 阴险
			"151",
		},
		["零散"] = {
			-- emoji: 167 name: 心碎
			"167",
		},
		["呵欠"] = {
			-- emoji: 147 name: 哈欠
			"147",
		},
		["疑点"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
		},
		["香菊片"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["慈"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["奋"] = {
			-- emoji: 130 name: 奋斗
			"130",
		},
		["死神"] = {
			-- emoji: 10286 name: 魔鬼笑
			"10286",
		},
		["畏"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["动肝火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["啖"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["万幸"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["牟取"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
		},
		["折磨"] = {
			-- emoji: 135 name: 折磨
			"135",
		},
		["敬礼"] = {
			-- emoji: 10282 name: 敬礼
			"10282",
		},
		["鸣锣登场"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["痴情"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["交融"] = {
			-- emoji: 246 name: 小纠结
			"246",
		},
		["散"] = {
			-- emoji: 167 name: 心碎
			"167",
		},
		["阳光"] = {
			-- emoji: 176 name: 太阳
			"176",
		},
		["饥"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["揉搓"] = {
			-- emoji: 135 name: 折磨
			"135",
		},
		["喝彩"] = {
			-- emoji: 121009 name: 喝彩
			"121009",
		},
		["制胜"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["敲"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["饵"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["起"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
		},
		["尸骨"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["诅咒"] = {
			-- emoji: 131 name: 咒骂
			"131",
		},
		["棒球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["愣神儿"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["饿"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["忽闪"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["馁"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["冒泡"] = {
			-- emoji: 10371 name: 冒泡
			"10371",
		},
		["奋起"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
			-- emoji: 130 name: 奋斗
			"130",
		},
		["听听"] = {
			-- emoji: 10407 name: 我听听
			"10407",
		},
		["冷汗"] = {
			-- emoji: 117 name: 冷汗
			"117",
		},
		["尸骸"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["打哈欠"] = {
			-- emoji: 147 name: 哈欠
			"147",
		},
		["贴水"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["幽灵"] = {
			-- emoji: 257 name: 幽灵
			"257",
		},
		["发令枪"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["跳脚"] = {
			-- emoji: 10376 name: 跺脚
			"10376",
		},
		["出汗"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["欢呼"] = {
			-- emoji: 121009 name: 喝彩
			"121009",
		},
		["亲切"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["声泪俱下"] = {
			-- emoji: 10374 name: 波波流泪
			"10374",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 105 name: 流泪
			"105",
		},
		["挂火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["奋斗"] = {
			-- emoji: 130 name: 奋斗
			"130",
		},
		["屠刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["鬼神"] = {
			-- emoji: 10286 name: 魔鬼笑
			"10286",
		},
		["菜刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["龙舟"] = {
			-- emoji: 10415 name: 划龙舟
			"10415",
			-- emoji: 10416 name: 中龙舟
			"10416",
			-- emoji: 10417 name: 大龙舟
			"10417",
		},
		["熹"] = {
			-- emoji: 176 name: 太阳
			"176",
		},
		["收听"] = {
			-- emoji: 10407 name: 我听听
			"10407",
		},
		["轻视"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["傻笑"] = {
			-- emoji: 128 name: 憨笑
			"128",
		},
		["嫌弃"] = {
			-- emoji: 10323 name: 嫌弃
			"10323",
		},
		["烟花"] = {
			-- emoji: 10333 name: 烟花
			"10333",
		},
		["观"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["萎谢"] = {
			-- emoji: 164 name: 凋谢
			"164",
		},
		["鱼狗"] = {
			-- emoji: 10396 name: 狼狗
			"10396",
		},
		["恐吓"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["战胜"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["现大洋"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["亲昵"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["满堂喝彩"] = {
			-- emoji: 121009 name: 喝彩
			"121009",
		},
		["龙船"] = {
			-- emoji: 10415 name: 划龙舟
			"10415",
			-- emoji: 10416 name: 中龙舟
			"10416",
			-- emoji: 10417 name: 大龙舟
			"10417",
		},
		["瓦刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["赞佩"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["通报"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["篮球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["衰落"] = {
			-- emoji: 164 name: 凋谢
			"164",
		},
		["挥汗"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["再见"] = {
			-- emoji: 139 name: 再见
			"139",
		},
		["看轻"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["藐视"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["致敬"] = {
			-- emoji: 10282 name: 敬礼
			"10282",
		},
		["折腾"] = {
			-- emoji: 135 name: 折磨
			"135",
		},
		["哆嗦"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["傻眼"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["变线"] = {
			-- emoji: 10312 name: 变形
			"10312",
		},
		["眉欢眼笑"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["月球"] = {
			-- emoji: 175 name: 月亮
			"175",
		},
		["金合欢花"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["跺"] = {
			-- emoji: 10376 name: 跺脚
			"10376",
		},
		["出"] = {
			-- emoji: 10403 name: 出去玩
			"10403",
		},
		["击"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["零星"] = {
			-- emoji: 167 name: 心碎
			"167",
		},
		["盘旋"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["亡灵"] = {
			-- emoji: 257 name: 幽灵
			"257",
		},
		["仰天大笑"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["情爱"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["满头大汗"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["蜂糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["打击"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["髑髅"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["上"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["扭结"] = {
			-- emoji: 246 name: 小纠结
			"246",
		},
		["下"] = {
			-- emoji: 10403 name: 出去玩
			"10403",
		},
		["拊掌"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["煎熬"] = {
			-- emoji: 135 name: 折磨
			"135",
		},
		["渔"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
		},
		["抓手"] = {
			-- emoji: 181 name: 握手
			"181",
		},
		["洒泪"] = {
			-- emoji: 10374 name: 波波流泪
			"10374",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 105 name: 流泪
			"105",
		},
		["变价"] = {
			-- emoji: 10312 name: 变形
			"10312",
		},
		["闪亮"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["舞"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["戒刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["发话"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["变相"] = {
			-- emoji: 10312 name: 变形
			"10312",
		},
		["知照"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["抱抱"] = {
			-- emoji: 178 name: 拥抱
			"178",
		},
		["昱"] = {
			-- emoji: 176 name: 太阳
			"176",
		},
		["枯萎"] = {
			-- emoji: 164 name: 凋谢
			"164",
		},
		["阴"] = {
			-- emoji: 151 name: 阴险
			"151",
			-- emoji: 175 name: 月亮
			"175",
		},
		["黑狗"] = {
			-- emoji: 10396 name: 狼狗
			"10396",
		},
		["威吓"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["托福"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["姊妹花"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["分析"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["太阴"] = {
			-- emoji: 175 name: 月亮
			"175",
		},
		["太阳"] = {
			-- emoji: 176 name: 太阳
			"176",
		},
		["群起"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
		},
		["撅嘴"] = {
			-- emoji: 101 name: 撇嘴
			"101",
		},
		["左轮"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["晃"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["剖解"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["观察"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["丝糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["拍掌"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["剖"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["晖"] = {
			-- emoji: 176 name: 太阳
			"176",
		},
		["开腔"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["乜"] = {
			-- emoji: 122 name: 白眼
			"122",
		},
		["关照"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["牟"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
		},
		["行礼"] = {
			-- emoji: 10282 name: 敬礼
			"10282",
		},
		["颤抖"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["天幸"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["憨笑"] = {
			-- emoji: 128 name: 憨笑
			"128",
		},
		["无声手枪"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["挥泪"] = {
			-- emoji: 10374 name: 波波流泪
			"10374",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 105 name: 流泪
			"105",
		},
		["险"] = {
			-- emoji: 151 name: 阴险
			"151",
		},
		["裂开"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["跺脚"] = {
			-- emoji: 10376 name: 跺脚
			"10376",
		},
		["噱"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["疑问"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
		},
		["赏金"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["诈唬"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["说话"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["虹"] = {
			-- emoji: 10369 name: 彩虹
			"10369",
		},
		["上场"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["白兔"] = {
			-- emoji: 175 name: 月亮
			"175",
		},
		["讲话"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["魔鬼"] = {
			-- emoji: 10286 name: 魔鬼笑
			"10286",
		},
		["白"] = {
			-- emoji: 122 name: 白眼
			"122",
		},
		["变形"] = {
			-- emoji: 10312 name: 变形
			"10312",
		},
		["撇嘴"] = {
			-- emoji: 101 name: 撇嘴
			"101",
		},
		["凋零"] = {
			-- emoji: 164 name: 凋谢
			"164",
		},
		["希望"] = {
			-- emoji: 10294 name: 期待
			"10294",
		},
		["哂笑"] = {
			-- emoji: 128 name: 憨笑
			"128",
		},
		["庆"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
			-- emoji: 10320 name: 庆祝
			"10320",
		},
		["忽明忽暗"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["握手"] = {
			-- emoji: 181 name: 握手
			"181",
		},
		["细碎"] = {
			-- emoji: 167 name: 心碎
			"167",
		},
		["非常"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["兴起"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
		},
		["裂缝"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["汗津津"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["贺岁"] = {
			-- emoji: 10303 name: 右拜年
			"10303",
			-- emoji: 10302 name: 左拜年
			"10302",
		},
		["抖"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["兜圈子"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["押金"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["喷饭"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["照会"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["发呆"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["纠"] = {
			-- emoji: 246 name: 小纠结
			"246",
		},
		["抡"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["衰败"] = {
			-- emoji: 164 name: 凋谢
			"164",
		},
		["蜂起"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
		},
		["回旋"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["阴险"] = {
			-- emoji: 151 name: 阴险
			"151",
		},
		["回见"] = {
			-- emoji: 139 name: 再见
			"139",
		},
		["无籽西瓜"] = {
			-- emoji: 156 name: 西瓜
			"156",
		},
		["仁慈"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["出神"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["发火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["花"] = {
			-- emoji: 10337 name: 花朵脸
			"10337",
		},
		["抱"] = {
			-- emoji: 178 name: 拥抱
			"178",
		},
		["骰子"] = {
			-- emoji: 10358 name: 骰子
			"10358",
		},
		["鞭炮"] = {
			-- emoji: 121002 name: 鞭炮
			"121002",
		},
		["手枪"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["相亲"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["花朵"] = {
			-- emoji: 10337 name: 花朵脸
			"10337",
		},
		["十二分"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["垒球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["分号"] = {
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["在天之灵"] = {
			-- emoji: 257 name: 幽灵
			"257",
		},
		["排球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["崇拜"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["仁"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["大笑"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["恭喜"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
		},
		["蔑视"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["哄笑"] = {
			-- emoji: 10283 name: 狂笑
			"10283",
		},
		["银洋"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["曲棍球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["动火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["鼓掌"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["经"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["逗号"] = {
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["奋勉"] = {
			-- emoji: 130 name: 奋斗
			"130",
		},
		["经过"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["磨难"] = {
			-- emoji: 135 name: 折磨
			"135",
		},
		["拍巴掌"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["特别"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["拜"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
		},
		["祈望"] = {
			-- emoji: 10294 name: 期待
			"10294",
			-- emoji: 10294 name: 期待
			"10294",
		},
		["网球"] = {
			-- emoji: 158 name: 篮球
			"158",
		},
		["央托"] = {
			-- emoji: 10353 name: 拜托
			"10353",
		},
		["利诱"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["骸骨"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["搂抱"] = {
			-- emoji: 178 name: 拥抱
			"178",
		},
		["体察"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["玉兔"] = {
			-- emoji: 175 name: 月亮
			"175",
		},
		["浅析"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["槐花"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["绞刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["目"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["十分"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["拜托"] = {
			-- emoji: 10353 name: 拜托
			"10353",
		},
		["拳"] = {
			-- emoji: 185 name: 拳头
			"185",
		},
		["阴骘"] = {
			-- emoji: 151 name: 阴险
			"151",
		},
		["零"] = {
			-- emoji: 167 name: 心碎
			"167",
		},
		["相"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["骷髅"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["破裂"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["木然"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["信号枪"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["疯狗"] = {
			-- emoji: 10396 name: 狼狗
			"10396",
		},
		["察看"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["月"] = {
			-- emoji: 175 name: 月亮
			"175",
		},
		["密切"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["呻吟"] = {
			-- emoji: 145 name: 左哼哼
			"145",
			-- emoji: 146 name: 右哼哼
			"146",
		},
		["色子"] = {
			-- emoji: 10358 name: 骰子
			"10358",
		},
		["飞吻"] = {
			-- emoji: 191 name: 飞吻
			"191",
		},
		["诱惑"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["鼓"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["施礼"] = {
			-- emoji: 10282 name: 敬礼
			"10282",
		},
		["拜年"] = {
			-- emoji: 10303 name: 右拜年
			"10303",
			-- emoji: 10302 name: 左拜年
			"10302",
		},
		["眸子"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["缶掌"] = {
			-- emoji: 10375 name: 超级鼓掌
			"10375",
			-- emoji: 142 name: 鼓掌
			"142",
		},
		["突起"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
		},
		["通知"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["勃兴"] = {
			-- emoji: 10413 name: 摇起来
			"10413",
		},
		["拿到"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
		},
		["银元"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["情网"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["挥"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["再会"] = {
			-- emoji: 139 name: 再见
			"139",
		},
		["悦服"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["西瓜"] = {
			-- emoji: 156 name: 西瓜
			"156",
		},
		["敲打"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["发糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["上台"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["奖金"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["碰巧"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["凶险"] = {
			-- emoji: 151 name: 阴险
			"151",
		},
		["绕圈子"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["疑窦"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
		},
		["流汗"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["大捷"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["眼"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["勃郎宁"] = {
			-- emoji: 121034 name: 手枪
			"121034",
		},
		["险恶"] = {
			-- emoji: 151 name: 阴险
			"151",
		},
		["睁"] = {
			-- emoji: 10289 name: 睁眼
			"10289",
		},
		["疑难"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
		},
		["闪耀"] = {
			-- emoji: 10404 name: 闪亮登场
			"10404",
		},
		["代金"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["顿号"] = {
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["出言"] = {
			-- emoji: 10402 name: 别说话
			"10402",
		},
		["变速"] = {
			-- emoji: 10312 name: 变形
			"10312",
		},
		["哈欠"] = {
			-- emoji: 147 name: 哈欠
			"147",
		},
		["魔"] = {
			-- emoji: 10286 name: 魔鬼笑
			"10286",
		},
		["狼狗"] = {
			-- emoji: 10396 name: 狼狗
			"10396",
		},
		["亲近"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["道贺"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
		},
		["现洋"] = {
			-- emoji: 10298 name: 元宝
			"10298",
		},
		["翻天复地"] = {
			-- emoji: 10391 name: 太沧桑
			"10391",
			-- emoji: 10263 name: 沧桑
			"10263",
		},
		["挨饿"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["筛"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["亲密"] = {
			-- emoji: 10360 name: 亲亲
			"10360",
			-- emoji: 10305 name: 右亲亲
			"10305",
			-- emoji: 152 name: 左亲亲
			"152",
		},
		["有礼"] = {
			-- emoji: 10282 name: 敬礼
			"10282",
		},
		["通告"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["烟火"] = {
			-- emoji: 10333 name: 烟花
			"10333",
		},
		["恼火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["萦回"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["佩"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["吹呼"] = {
			-- emoji: 121009 name: 喝彩
			"121009",
		},
		["企鹅"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 10378 name: 企鹅笑哭
			"10378",
		},
		["托人"] = {
			-- emoji: 10353 name: 拜托
			"10353",
		},
		["紫荆花"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["引诱"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["裂口"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["敬佩"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["祝贺"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
		},
		["战抖"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["吓唬"] = {
			-- emoji: 10325 name: 惊吓
			"10325",
		},
		["分裂"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["发愣"] = {
			-- emoji: 103 name: 发呆
			"103",
		},
		["侥幸"] = {
			-- emoji: 10405 name: 好运来
			"10405",
		},
		["蛋糕"] = {
			-- emoji: 168 name: 蛋糕
			"168",
		},
		["异常"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["柔情"] = {
			-- emoji: 190 name: 爱情
			"190",
		},
		["疑团"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
		},
		["庆贺"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
		},
		["女皇"] = {
			-- emoji: 10406 name: 姐是女王
			"10406",
		},
		["咖啡"] = {
			-- emoji: 160 name: 咖啡
			"160",
		},
		["满面笑容"] = {
			-- emoji: 100 name: 微笑
			"100",
		},
		["引号"] = {
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["哼哼"] = {
			-- emoji: 145 name: 左哼哼
			"145",
			-- emoji: 146 name: 右哼哼
			"146",
		},
		["鬼魔"] = {
			-- emoji: 10286 name: 魔鬼笑
			"10286",
		},
		["牛脾气"] = {
			-- emoji: 10306 name: 牛气冲天
			"10306",
		},
		["发奋"] = {
			-- emoji: 130 name: 奋斗
			"130",
		},
		["析"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["眼睛"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["盼望"] = {
			-- emoji: 10294 name: 期待
			"10294",
		},
		["钦佩"] = {
			-- emoji: 10318 name: 崇拜
			"10318",
		},
		["想到"] = {
			-- emoji: 10338 name: 我想开了
			"10338",
		},
		["鬼魂"] = {
			-- emoji: 257 name: 幽灵
			"257",
		},
		["挥舞"] = {
			-- emoji: 199 name: 挥手
			"199",
		},
		["撒旦"] = {
			-- emoji: 10286 name: 魔鬼笑
			"10286",
		},
		["仁爱"] = {
			-- emoji: 10383 name: 企鹅爱心
			"10383",
			-- emoji: 166 name: 爱心
			"166",
		},
		["鄙薄"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["小视"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["庆祝"] = {
			-- emoji: 10320 name: 庆祝
			"10320",
		},
		["阴魂"] = {
			-- emoji: 257 name: 幽灵
			"257",
		},
		["砍刀"] = {
			-- emoji: 155 name: 菜刀
			"155",
		},
		["打圈子"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["沧海桑田"] = {
			-- emoji: 10391 name: 太沧桑
			"10391",
			-- emoji: 10263 name: 沧桑
			"10263",
		},
		["打呵欠"] = {
			-- emoji: 147 name: 哈欠
			"147",
		},
		["体悟"] = {
			-- emoji: 10338 name: 我想开了
			"10338",
		},
		["上火"] = {
			-- emoji: 111 name: 发怒
			"111",
		},
		["路过"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["好处费"] = {
			-- emoji: 10295 name: 拿到红包
			"10295",
			-- emoji: 10345 name: 红包多多
			"10345",
		},
		["欢庆"] = {
			-- emoji: 10320 name: 庆祝
			"10320",
		},
		["巴望"] = {
			-- emoji: 10294 name: 期待
			"10294",
		},
		["鞭"] = {
			-- emoji: 121002 name: 鞭炮
			"121002",
		},
		["变频"] = {
			-- emoji: 10312 name: 变形
			"10312",
		},
		["饥肠辘辘"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["道喜"] = {
			-- emoji: 10370 name: 祝贺
			"10370",
		},
		["牛劲"] = {
			-- emoji: 10306 name: 牛气冲天
			"10306",
		},
		["回绕"] = {
			-- emoji: 10401 name: 超级转圈
			"10401",
			-- emoji: 195 name: 转圈
			"195",
		},
		["凋谢"] = {
			-- emoji: 164 name: 凋谢
			"164",
		},
		["微醺"] = {
			-- emoji: 147 name: 哈欠
			"147",
		},
		["肉眼"] = {
			-- emoji: 10265 name: 辣眼睛
			"10265",
		},
		["流泪"] = {
			-- emoji: 10374 name: 波波流泪
			"10374",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 105 name: 流泪
			"105",
		},
		["白骨"] = {
			-- emoji: 137 name: 骷髅
			"137",
		},
		["张目"] = {
			-- emoji: 10289 name: 睁眼
			"10289",
		},
		["过"] = {
			-- emoji: 10381 name: 路过
			"10381",
		},
		["取胜"] = {
			-- emoji: 182 name: 胜利
			"182",
		},
		["期望"] = {
			-- emoji: 10294 name: 期待
			"10294",
		},
		["汗流浃背"] = {
			-- emoji: 127 name: 流汗
			"127",
		},
		["观测"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["凋落"] = {
			-- emoji: 164 name: 凋谢
			"164",
		},
		["分外"] = {
			-- emoji: 10363 name: 狗狗可怜
			"10363",
			-- emoji: 154 name: 可怜
			"154",
		},
		["白花"] = {
			-- emoji: 163 name: 玫瑰
			"163",
		},
		["问号"] = {
			-- emoji: 10367 name: 狗狗疑问
			"10367",
			-- emoji: 132 name: 疑问
			"132",
			-- emoji: 10268 name: 问号脸
			"10268",
		},
		["知会"] = {
			-- emoji: 10341 name: 打招呼
			"10341",
		},
		["雀巢咖啡"] = {
			-- emoji: 160 name: 咖啡
			"160",
		},
		["饿饭"] = {
			-- emoji: 124 name: 饥饿
			"124",
		},
		["勾引"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["斗争"] = {
			-- emoji: 130 name: 奋斗
			"130",
		},
		["鄙视"] = {
			-- emoji: 148 name: 鄙视
			"148",
		},
		["察"] = {
			-- emoji: 10269 name: 暗中观察
			"10269",
		},
		["颤栗"] = {
			-- emoji: 193 name: 发抖
			"193",
		},
		["叩"] = {
			-- emoji: 138 name: 敲打
			"138",
			-- emoji: 10351 name: 敲敲
			"10351",
		},
		["奋发"] = {
			-- emoji: 130 name: 奋斗
			"130",
		},
		["剖析"] = {
			-- emoji: 10314 name: 仔细分析
			"10314",
		},
		["诱"] = {
			-- emoji: 184 name: 勾引
			"184",
		},
		["嫦娥"] = {
			-- emoji: 175 name: 月亮
			"175",
		},
		["开绽"] = {
			-- emoji: 10357 name: 裂开
			"10357",
		},
		["潸然泪下"] = {
			-- emoji: 10374 name: 波波流泪
			"10374",
			-- emoji: 10379 name: 企鹅流泪
			"10379",
			-- emoji: 105 name: 流泪
			"105",
		},
		["揽"] = {
			-- emoji: 178 name: 拥抱
			"178",
		},
	},

}
Emojis:RegisterStickerPack(pack)
